{
    'legend': 'здесь будет то-то-то',
    'container_calculation_text': 'блаблабла',
    'rows': [
        {
            'supply_chain': 'Китай - Польша',
            'destination_route': 'Китай - Польша через Россию',
            '3PL1': 4500,
            '3PL2': 4800,
            '3PL3': None,
        }
    ],
    'containers': [
        {
            'type': '20-футовый контейнер 5,9мх2,33мх2,35м (Д*Ш*В), грузоподъемность 21,8т',
            'answer1': '5,9*2,33*2,35*=32.3',
            'answer2': '1,1*1,1*1=1,21',
            'answer3': '(5,9/1,1)*(2,33/1,1)*(2,35/1)=20',
            'answer4': '20*1,21/32,3 = 0,75',
            'answer5': '20*0,5/21,8 = 0,46',
        },
        {
            'type': '40-футовый контейнер 12м*2,33м*2,35м (Д*Ш*В) грузоподъёмно-сть 26,4 т',
            'answer1': 65.7,
            'answer2': 1.21,
            'answer3': 40.0,
            'answer4': 0.74,
            'answer5': 0.75,
        },
    ],
}
