{
    'id': '67c5a798-98e1-4e76-9d8d-21583e57ef73',
    'description': 'Компания имеет производственные мощности в Китае, отправляя свою продукцию в Европу через порты Германии преимущественно морским путём в 20-футовых контейнерах с продолжительностью от 40 суток. С учётом значительной продолжительности доставки продукции и случившегося кризиса у поставщика транспортных услуг, от существующей схемы Компания планирует отказаться. Кроме того, в условиях увеличения спроса на производимую продукцию Компания расширила географию присутствия, разместив дополнительные производственные мощности в Японии и Корее и рассматривает новые цепи поставок. В связи с повышением привлекательности ускоренных контейнерных сервисов через Казахстан, Монголию и Россию, Компания планирует использовать новые маршруты и технологии доставки продукции. Перед Логистическим департаментом поставлена задача поиска оптимальных маршрутов цепей поставок продукции в страны Европы. Проект поручен группе инициативных логистов.',
    'logist1':'',
    'logist2':'',
    'logist3':'',
    'bets':{
        'right': [{
            'id': '67c5a798-98e1-4e76-9d8d-23643e57ef73',
            'incoterms': [{'name': 'EXW', 'role': 'BUYER', 'rate': 2.0}],
        }],
        'fake': [{
            'name': 'Something'
        }]
    }
}