logists = [
    {
        'letter': 'Р',
        'types': ['TRAINS'],
        'header': """Компания Р – Лидер трансъевразийских железнодорожных контейнерных перевозок, предоставляющий комплексные услуги на перевозку грузов на самом протяженном участке Шелкового пути от границ с Китаем до границ 
с Европой, крупнейший оператор транзитных контейнерных перевозок в сообщении Китай-Европа-Китай по территории России, Казахстана и Беларуси.""",
        'body': [
            {
                'type': 'text',
                'texts': [
                    """Созданная в 2018 году выступает оператором транзитных контейнерных сервисов и транспортирует грузы в сообщении Китай–Европа–Китай 
в составе регулярных контейнерных поездов через территорию России, Казахстана и Беларуси."""
                ],
            },
            {'type': 'dash', 'texts': ['Наша миссия']},
            {
                'type': 'text',
                'texts': [
                    """Развитие транзитного потенциала ЕАЭС через внедрение высокотехнологичных логистических сервисов, требующих скоординированной политики железных дорог и регуляторов 
на пространстве колеи 1520 мм"""
                    """Компания предоставляет комплекс транспортно-логистических услуг 
по перевозке контейнеров отправителя (Shipper Owned Container — SOC) 
в составе регулярных контейнерных поездов по МТК «Восток-Запад»."""
                ],
            },
            {'type': 'dash', 'texts': ['Транзит']},
            {
                'type': 'text',
                'texts': [
                    'Маршруты Китай (Достык/Алтынколь) — Европа (Брест, Брузги, Свислочь, Калининград) по территориям Казахстана, России и Беларуси'
                ],
            },
            {'type': 'dash', 'texts': ['Импорт']},
            {
                'type': 'text',
                'texts': ['Перевозка грузов из КНР в Россию и Беларусь через погранпереходы Достык/Алтынколь'],
            },
            {'type': 'dash', 'texts': ['Экспорт']},
            {
                'type': 'text',
                'texts': [
                    'Перевозка грузов из России и Беларуси в КНР до погранпереходов Достык/Алтынколь',
                    'Комплекс транспортно-логистических услуг включает:',
                ],
            },
            {
                'type': 'enumerated',
                'texts': [
                    'Железнодорожный тариф по Казахстанской, Российским и Белорусской железным дорогам',
                    'Сборы за сменное сопровождение груза',
                    'Услуги по таможенному оформлению в соответствии с таможенным законодательством ЕАЭС',
                    'Сбор за таможенный осмотр перевозимых грузов',
                    'Предоставление фитинговой платформы',
                    'Погрузо-разгрузочные операции при смене колеи на территории ЕАЭС',
                ],
            },
            {'type': 'text', 'texts': ['Наши достижения:']},
            {
                'type': 'dash',
                'texts': [
                    'Стремительное развитие экспортно-импортных сервисов',
                    'Кратный рост экспорта из Беларуси',
                    'Первый контракт с оплатой в китайских юанях',
                    'Пилотные отправки полносоставных рефрижераторных поездов в сообщении Китай-Россия',
                    """- Экологические инициативы с нашим участием: Казахстан – проект 
по восстановлению тугайного леса на территории «Иле-Балхаш»; Россия – проект по восстановлению численности зубров в Северной Осетии"""
                    'Выход в финал премии «Формула движения» в номинации «Лучшее решение в области грузовой логистики»',
                    'Вошли в числе 400 крупнейших компаний России',
                    """Генеральный директор— в списке 250 лучших топ-менеджеров России 
(по версии ИД «Коммерсант»)""",
                ],
            },
        ],
    },
    {
        'letter': 'П',
        'types': ['CARS', 'TRAINS'],
        'header': """Компания П — Наша команда успешно осуществляет доставку грузов по всей территории России, СНГ и Европе, 
    в том числе сложные маршруты в Воркуту, на о. Сахалин, 
    на Курильские острова в Ирландию.""",
        'body': [
            {
                'type': 'text',
                'texts': [
                    """Мы находимся в Санкт-Петербурге на Северном таможенном посту. 
    У нас есть склад и вся необходимая техника для перегрузки Ваших грузов. При необходимости производим таможенное оформление и сертификацию товаров.

    Перевозим негабаритный груз. Перевозим грузы как таможенный перевозчик, осуществляем экспресс доставку в Европу (работаем со всей Европой). Работаем с карнетом АТА. Доставка грузов FTL и LTL. Перевозка грузов контейнером авто+ж/д+авто. Находим лучшее решение, исходя 
    из поставленных задач клиента.

    Услуги перевозки грузов по России, международная логистика, таможенное оформление, страхование, сертификация товаров.

    В 90% случаев лучшие цены и сроки. Работаем с грузами от 100 кг.

    Мы настроены на долгосрочные и успешные отношения с нашим клиентом.""",
                ],
            }
        ],
    },
    {
        'letter': 'Ф',
        'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
        'header': """Компания Ф с 1967 года доставляет товары в нужное время, в нужное место, с пользой для всех. Мы сотрудничаем 
с партнерами и клиентами в секторах потребительских товаров, розничной торговли, красоты и косметики, промышленного производства и здравоохранения, чтобы действовать сообща, создавая модели ответственной цепочки поставок. Мы расширяем границы, чтобы к 2030 году стать лидером устойчивых омниканальных цепочек поставок.
""",
        'body': [
            {
                'type': 'text',
                'texts': [
                    """Мы являемся «пионерами» в области пулинга транспортных средств 
и концепции под одной крышей one-roof. Мы продвигаем экологичные решения для копакинга и склады с нулевым выбросом углерода. Мы прилагаем все усилия, чтобы оптимизировать способы использования ресурсов, постоянно отслеживая и уменьшая углеродный след. Мы развиваем инновационную и устойчивую омниканальную дистрибуцию при помощи наших городских решений и предложения для готовой продукции в больших объемах. И мы не останавливаемся на достигнутом! Где бы мы ни находились, мы становимся надежным партнером 
для локальных компаний. Это было бы невозможно без нашей коллективной внутренней страсти и энергии, которую мы разделяем, создавая и реализовывая наши проекты. Вот почему мы ежедневно стараемся улучшать нашу рабочую среду и благополучие наших команд.

Мы оказываем полный спектр транспортно-логистических услуг 
и разрабатываем индивидуальные логистические решения для реализации ваших задач в сфере логистики. В рамках нашего комплекса логистических услуг мы предлагаем складские услуги и обработку товаров и грузов на складах, транспортные услуги, услуги таможенного оформления, IT-решения и комплексные решения для сегмента e-commerce.

Наша цель — помочь вам повысить эффективность бизнеса, снизить затраты и обеспечить надежность во всей цепи поставок.

Свяжитесь с нами, чтобы обсудить ваши потребности в логистических услугах. Мы готовы предложить вам оптимальные решения, адаптированные под требования вашего бизнеса.
"""
                ],
            }
        ],
    },
]
