# -*- coding: utf8 -*-
event = {
  "id": "670d01abbd3d228d0ab6a511",
  "computer_id": 3,
  "is_finished": False,
  "event_type": "PR1",
  "event_mode": "CLASS",
  "created_at": {
    "$date": "2024-10-14T11:33:24.402Z"
  },
  "finished_at": None,
  "users_ids": [
    "65e310cfef52ed0a1fa9cc82"
  ],
  "steps_results": [
    {
      "test_index": 0,
      "step_code": "SELECT_LOGIST",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 0,
      "incoterm": None,
      "description": None,
      "is_finished": True,
      "comments": "Выбираем логиста. Ни на что не влияет в ПО"
    },
    {
      "test_index": 0,
      "step_code": "EXW_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "EXW",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "EXW_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "EXW",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "FCA_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FCA",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Экспортное таможенное оформление: 307']\nНеобязательные ставки: ['Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104']"
    },
    {
      "test_index": 0,
      "step_code": "FCA_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FCA",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Основная перевозка: 536', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "FAS_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FAS",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "FAS_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FAS",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка (морской фрахт): 435', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "FOB_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FOB",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "FOB_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "FOB",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Основная перевозка (морской фрахт): 435', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "CFR_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CFR",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка (морской фрахт): 435']\nНеобязательные ставки: ['Выгрузка с транспортного средства основной перевозки : 93']"
    },
    {
      "test_index": 0,
      "step_code": "CFR_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CFR",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "CIF_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CIF",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка (морской фрахт): 435', 'Страхование: 29']\nНеобязательные ставки: ['Выгрузка с транспортного средства основной перевозки : 93']"
    },
    {
      "test_index": 0,
      "step_code": "CIF_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CIF",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "CIP_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CIP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536', 'Страхование: 29']\nНеобязательные ставки: ['Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "CIP_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CIP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Импортное таможенное оформление: 400']"
    },
    {
      "test_index": 0,
      "step_code": "CPT_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CPT",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536']\nНеобязательные ставки: ['Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "CPT_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "CPT",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Импортное таможенное оформление: 400']"
    },
    {
      "test_index": 0,
      "step_code": "DAP_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DAP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Перевозка до места назначения : 223']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "DAP_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DAP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Импортное таможенное оформление: 400', 'Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "DPU_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DPU",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Перевозка до места назначения : 223', 'Выгрузка из транспортного средства в месте назначения: 102']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "DPU_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DPU",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Импортное таможенное оформление: 400']"
    },
    {
      "test_index": 0,
      "step_code": "DDP_SELLER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DDP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Упаковка и маркировка товара на складе продавца: 49', 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage): 90', 'Внутренняя перевозка: 203', 'Выгрузка с транспортного средства внутренней перевозки: 93', 'Экспортное таможенное оформление: 307', 'Погрузка на транспортное средство основной перевозки (Main Carriage): 104', 'Основная перевозка: 536', 'Выгрузка с транспортного средства основной перевозки : 93', 'Погрузка на транспортное средство перевозки до места назначения (On-carriage): 102', 'Импортное таможенное оформление: 400', 'Перевозка до места назначения : 223']\nНеобязательные ставки: []"
    },
    {
      "test_index": 0,
      "step_code": "DDP_BUYER",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 3,
      "incoterm": "DDP",
      "description": None,
      "is_finished": True,
      "comments": "Обязательные ставки: ['Выгрузка из транспортного средства в месте назначения: 102']"
    },
    {
      "test_index": 0,
      "step_code": "OPTIONS_COMPARISON",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 0,
      "incoterm": None,
      "description": None,
      "is_finished": True,
      "comments": "Табличка для сравнения инкотермов, ничего не делаем, можно лишь нажать далее"
    },
    {
      "test_index": 0,
      "step_code": "CONDITIONS_SELECTION",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 0,
      "incoterm": None,
      "description": None,
      "is_finished": True,
      "comments": "Студент выбирает любой вариант ( ни на что не влияет в ПО )"
    },
    {
      "test_index": 0,
      "step_code": "DESCRIBE_OPTION",
      "users_ids": [
        "65e310cfef52ed0a1fa9cc82"
      ],
      "fails": 0,
      "incoterm": None,
      "description": None,
      "is_finished": True,
      "comments": "Пишем обоснование ( не менее 150 символов )"
    }
  ],
  "results": [],
  "current_step": {
    "id": 26,
    "code": "TEST_1",
    "name": "Тестовый вопрос №1",
    "role": "ALL"
  },
  "test_results": [
    [],
    [],
    []
  ],
  "legend": "Российский Покупатель рассматривает заключение контракта с иностранным Продавцом на поставку партии товара (сетевое оборудование) из Бильбао (Испания) в Выборг (Россия). Стоимость партии товара – 2 900 у.е.",
  "logists": [
    {
      "letter": "Ц",
      "types": [
        "TRAINS"
      ],
      "header": "Компания Ц — независимый оператор грузовых железнодорожных перевозок, лидирующий по количеству инновационного парка на сети РЖД.",
      "body": "Направления деятельности\n\n- предоставление подвижного состава под перевозку различных номенклатур грузов как во внутрироссийском, так и в международном сообщении;\n\n- предоставление подвижного состава в арендное пользование;\n\n- транспортно-экспедиционное сопровождение груза по сети РЖД \nи иностранных государств\n\nПри выполнении логистических задач Общество ориентируется на поиск оптимальных решений. Четко отлаженный механизм взаимодействия \nсо всеми участниками перевозочного процесса позволяет максимально эффективно задействовать ресурсы компании.\n\nМиссия\n\nНепрерывно развиваясь и двигаясь вперед, мы стремимся к достижению безупречного эффекта своей профессиональной деятельности. Предлагая один из самых молодых инновационных парков подвижного состава\nи внимательное обслуживание, мы предоставляем клиентам лучшие возможности для развития бизнеса. Мы не изобретаем колесо, мы его совершенствуем! \n\nСтратегия\n\n1) Быть лидером. Мы нацелены на укрепление лидирующих позиций на рынке грузовых железнодорожных перевозок\n\n2) Быть устойчивым и универсальным. Мы дорожим долгосрочными партнерскими отношениями с крупными промышленными предприятиями \nи частными компаниями-грузоотправителями\n\n3) Быть современным и гибким. Мы работаем над внедрением новых технологий и бизнес-процессов, повышающих уровень сервиса \nи организации перевозочного процесса\n\n4) Повышать уровень знаний и компетенций. Мы совершенствуемся изнутри, постоянно развивая профессиональные компетенции нашей команды\n\nЦенности и принципы\n- Мобильность и лидерство. Мы стремимся быть лучшими и быстро реагировать на изменение рыночной ситуации, применяя индивидуальный подход к каждому клиенту;\n\n- Ответственность и профессионализм. Мы создаем благоприятную атмосферу для того, чтобы вклад каждого сотрудника положительно влиял на рост нашего бизнеса и бизнеса клиента, и стараемся выполнять свои обещания, оценивая результаты своей деятельности по самым строгим критериям;\n\n- Доверие и честность. Мы работаем в соответствии с высокими этическими стандартами, выступаем за прозрачность ведения бизнеса \nи доверяем своим сотрудникам, клиентам и партнерам;\n\n- Уважение к интересам клиента и его времени. Мы убеждены, что уважение стоит во главе партнерский взаимоотношений, поэтому погружаемся \nс головой в каждую стоящую перед нами задачу. Мы также ценим свое \nи чужое время, оно быстротечно и невосполнимо.\n\n- Команда является самым ценным ресурсов Общества. Мы дорожим каждым ее членом и поддерживаем стремления совершенствовать профессиональные навыки, инвестируя в человеческий капитал. \n\nЗадачи\n\n1) поддержание здоровой конкурентной среды;\n\n2) оказание положительного эффекта на развитие рынка железнодорожных перевозок России в целом\n\nПреимущества\n\n- один из крупнейших парков полувагонов. Компания занимает 3-е место по парку полувагонов на сети РЖД\n\n- самый большой парк инновационных полувагонов. Компания занимает 1-е место по парку инновационных полувагонов на сети РЖД\n\n- один из самых молодых парков на сети РЖД. Средний возраст парка компании составляет 5,9 лет при общесетевом — 10,5 лет. Компания занимает 2-е место по новизне парка среди других операторов на сети РЖД\n\n- передовые информационные технологии, позволяющее наиболее эффективно организовать процесс перевозки груза. Предлагаем участникам рынка железнодорожных грузовых перевозок новейшие цифровые решения\n\n- команда высококлассных специалистов. Мы привлекаем к работе квалифицированных менеджеров с опытом работы в транспортной отрасли и высокопрофессиональных специалистов из сфер IT, экономики \nи финансов. Кроме того, компания развивает профессиональные навыки своих сотрудников: среди сотрудников профильных подразделений проводится техническое обучение по устройству и обслуживанию инновационных полувагонов, деповскому ремонту, а также практика непосредственно на производственных площадках.\n"
    },
    {
      "letter": "Л",
      "types": [
        "AIRPLANES",
        "CARS"
      ],
      "header": "Компания Л — мультисервисный оператор логистических услуг, эксперт в сфере комплексных решений \nи организации грузоперевозок на территории России \nи за рубежом.",
      "body": "Компания основана в 2001 году.\n\nФилиальная сеть насчитывает свыше 300 отделений в России, Азербайджане, Армении, Беларуси, Казахстане, Узбекистане, Таджикистане, Киргизии, Турции и Китае.\n\nЕжегодно услугами компании пользуются 4,5 млн клиентов.\n\nМы осуществляем доставку различных грузов массой до 20 тонн \nво многие города Российской Федерации, а также в Республику Казахстан.\n\nФилиалы расположены в 128 городах. Ежегодно у нас заказывают транспортно-экспедиционные услуги свыше 1,5 млн. клиентов.\n\nВиды перевозки:\n\n- Автоперевозка\n\nКомпания предоставляет транспортные услуги, которые включают в себя прием и оформление грузов в филиале компании, нанесение маркировки (уникального штрих-кода), перевозку грузов, оповещение клиента \nо прибытии грузов в пункт назначения (SMS, e-mail информирование) \nи выдачу груза получателю.\n\n- Авиаперевозка\n\nВ транспортно-экспедиторские услуги компании входит: прием грузов \nу отправителя, подбор наиболее подходящих рейсов, доставка грузов \nв аэропорт, оформление авианакладной, оплата терминальных сборов, перевозка грузов в филиал компании ПЭК в пункте назначения и их выдача получателю.\n\n- Перевозка сборного груза\n\nДанный вид транспортных услуг – приоритетное направление работы. Транспортировка в составе сборных грузов дает возможность Компании сокращать расходы на перевозку, что создает выгодные условия \nи для клиентов.\n\n- Экспресс-Перевозка\n\nУслуга «Экспресс-Перевозка» позволяет пользователям сохранить самый ценный и дорогой ресурс – время. По некоторым направлениям экономия составляет до 48 часов по сравнению с обычными сроками доставки.\n\n- Доставка в торговые сети\n\nУслуга «Доставка в торговые сети» адресована поставщикам торговых сетей Тандер, Ашан, Лента, X5 Retail\n\n- Переезды по России\n\nДля нас важен каждый клиент: и семья, решившая переехать в другой город, и огромная торговая сеть. Поэтому ежегодно нам доверяют миллионы заказчиков по всей России!\n\n- Full-Truck сервис\n\nЗаказ транспорта «под ключ» - индивидуальный подход для перевозок \nна разовой и регулярной основе. Любые объемы, любые направления, гибкие расценки.\n\nПреимущества:\n\n1) Компания располагает всем необходимым для организации доставки груза на участке первой и последней мили.\n\n2) Практически в каждом филиале разработаны маршруты \nдля консолидированных забора и доставки грузов из населенных пунктов, где нет филиалов, позволяющие сэкономить от 20 до 80% стоимости. География предоставления транспортных услуг льготной доставки превышает 500 маршрутов.\n\n3) В перечень транспортно-экспедиционных услуг входит также выполнение погрузо-разгрузочных работ специалистами Компании, в том числе с привлечением для этих работ специальной техники.\n\n4) Обработка груза на складе — обязательная услуга при областной перевозке.\n\n5) Комплексная услуга от компании по поиску, проверке, покупке \nи доставке товаров от поставщиков из Китая, Казахстана, Узбекистана \nи других стран.\n\n6) Кроме услуги грузоперевозок, вы также можете заказать услугу страхования грузов, которые нужно доставить в города Российской Федерации (ставка 0,1% от стоимости груза) и в Республику Казахстан (ставка 0,3%).\n\n7) Для обеспечения сохранности груза мы предлагаем более 10 видов дополнительной упаковки.\n\n8) При заказе транспортно-экспедиторских услуг можно дополнительно воспользоваться услугой возврата документов с подписью и печатью получателя груза.\n\n9) Компания предоставляет транспортные услуги более чем 50 федеральным торговым сетям.\n\n10) По желанию клиента мы подготовим дубликат акта об оказанных услугах грузоперевозок, счет-фактуры или заверенную копию документа на выдачу груза.\n\n11) Удобные транспортные услуги для интернет-магазинов и других компаний дистанционной торговли: прием оплаты от получателя в момент выдачи груза и оперативный перевод денежных средств продавцу.\n\n12) «Доставка ко времени»: дополнительная услуга при доставке, которая подразумевает доставку в сокращенный временной интервал. Вместо 4х часов интервал сокращается до 30 минут.\n\n13) Доставка документов курьером в Москве и Московской области.\n"
    },
    {
      "letter": "Г",
      "types": [
        "TRAINS",
        "SHIPS",
        "CARS"
      ],
      "header": "Компания Г уже более 10 лет занимается железнодорожными, мультимодальными, автомобильными и морскими перевозками.",
      "body": "Наша задача:\n\nОбеспечение качественной логистикой клиентов «от двери до двери» \nс полным информационным и документальным сопровождением.\n\nУслуги компании:\n\n- Доставка из Китая\nОбратившись в компанию, Вы получите до 3-х вариантов доставки груза. Специалисты при необходимости помогут Вам определить наиболее подходящий вариант исходя из Ваших пожеланий и критериев.\n\nЗа все время нашей работы мы перевезли более 20 000 тонн различного вида груза: от морской рыбы до многотонных деталей портовых кранов.\n\n- Железнодорожные перевозки\nДоставляем груз в короткие сроки, работаем по системе доставки \n«от двери до двери». Стоимость перевозки грузов ЖД транспортом – самая оптимальная в сравнении с иными типами грузоперевозок.\n\nВ зависимости от характеристик перемещаемого груза, условий транспортировки, объемов ЖД перевозки грузов по России организовываются с привлечением крытых вагонов, вагонов для сыпучих материалов, цистерн, контейнеров, платформ, рефрижераторов.\n\n- Склад\n\nВыбирая в качестве партнера компанию, клиент полностью избавляется \nот необходимости организовывать собственную складскую инфраструктуру. Ведь данная деятельность сопровождается массой сложностей: наладить контроль над работой персонала, поиск высококлассного управленца, постоянный ремонт техники \nи предотвращение поломок, сложности при учете расходных материалов.\n\nКомпания имеет открытый и закрытый склад. Применяем в соответствии \nс характеристиками груза, сроками хранения и пожеланиями клиента.\n\n- Мультимодальные перевозки\n\nОрганизуем транспортировку грузов по мультимодальной системе перевозок, предполагающей задействование нескольких видов транспорта. Для оперативной доставки привлекаем железнодорожный, автомобильный, морской, авиационный транспорт.\n\nОтличительная черта мультимодальных грузовых перевозок — перемещение грузов различным транспортом без переупаковывания. Это идеальный вариант реализации системы транспортировки «от двери \nдо двери», по которой работает компания \n\n- Сборные грузы\n\nВ компании вы можете выбрать тот вариант грузоперевозки, который будет отвечать вашим потребностям:\n\n1) Если нужна срочная доставка сборных грузов и цена для вас неважна, то для этих целей подойдет авиаперевозка.\n\n2) Если хотите доставить товар быстро, но по доступной цене — перевозка сборных грузов автотранспортом.\n\n3) Если у вас в приоритете низкая стоимость — вам подойдут Ж/Д \nили морские перевозки.\n\n4) Вы также можете заказать контейнерную перевозку грузов — этот способ считается одним из наиболее безопасных: содержимое контейнеров надежно защищено от воздействия погодных условий, \nа универсальность тары позволяет легко и без повреждений перегружать товары с одного вида транспортного средства на другой.\n\n- Перевозка легковых автомобилей\n\nПредлагаем перевезти Ваш автомобиль в режиме «одного окна»: Вашу перевозку полностью ведет один менеджер под ключ, который с Вами \nна связи 24/7.\n\nВ зависимости от маршрута и пожеланий клиента организуем перевозку легковых автомобилей ЖД-транспортом (контейнерами/вагонами/сетками) или АВТО-транспортом (автовозами и эвакуаторами, в т.ч. крытыми), \nа в исключительных случаях и АВИА-транспортом.\n\n- Перевозка спецтехники до 300 тонн\n\n- Перевозка опасных и температурных грузов\n\n- Переезд роялей, пианино и фортепиано\n\n- Переезд завода и фабрики\n\nПреимущества и гарантии нашей компании:\n\n- 3 варианта за 24 часа \n\n- Индивидуальный подход к каждому клиенту\n\n- Склад на станции Кунцево 2 Московской железной дороги\n\n- Оптимальные решения\n"
    }
  ],
  "chosen_logist_letter": None,
  "product": "сетевое оборудование",
  "from_country": "Бильбао (Испания)",
  "to_country": "Выборг (Россия)",
  "product_price": 2900,
  "bets": [
    {
      "id": 0,
      "name": "Упаковка и маркировка товара на складе продавца",
      "rate": 49,
      "bet_pattern": {
        "buyer": [],
        "seller": [
          "EXW",
          "FCA",
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": []
      }
    },
    {
      "id": 1,
      "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
      "rate": 90,
      "bet_pattern": {
        "buyer": [
          "EXW"
        ],
        "seller": [
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": [
          "FCA"
        ]
      }
    },
    {
      "id": 2,
      "name": "Внутренняя перевозка",
      "rate": 203,
      "bet_pattern": {
        "buyer": [
          "EXW"
        ],
        "seller": [
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": [
          "FCA"
        ]
      }
    },
    {
      "id": 3,
      "name": "Выгрузка с транспортного средства внутренней перевозки",
      "rate": 93,
      "bet_pattern": {
        "buyer": [
          "EXW"
        ],
        "seller": [
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": [
          "FCA"
        ]
      }
    },
    {
      "id": 4,
      "name": "Экспортное таможенное оформление",
      "rate": 307,
      "bet_pattern": {
        "buyer": [
          "EXW"
        ],
        "seller": [
          "FCA",
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": []
      }
    },
    {
      "id": 5,
      "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
      "rate": 104,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FAS"
        ],
        "seller": [
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP",
          "FOB",
          "CFR",
          "CIF"
        ],
        "common": [
          "FCA"
        ]
      }
    },
    {
      "id": 6,
      "name": "Основная перевозка (морской фрахт)",
      "rate": 435,
      "bet_pattern": {
        "buyer": [
          "FAS",
          "FOB"
        ],
        "seller": [
          "CFR",
          "CIF"
        ],
        "common": []
      }
    },
    {
      "id": 7,
      "name": "Основная перевозка",
      "rate": 536,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA"
        ],
        "seller": [
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "DDP"
        ],
        "common": []
      }
    },
    {
      "id": 8,
      "name": "Страхование",
      "rate": 29,
      "bet_pattern": {
        "buyer": [],
        "seller": [
          "CIP",
          "CIF"
        ],
        "common": []
      }
    },
    {
      "id": 9,
      "name": "Выгрузка с транспортного средства основной перевозки ",
      "rate": 93,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA",
          "FAS",
          "FOB"
        ],
        "seller": [
          "DAP",
          "DPU",
          "DDP"
        ],
        "common": [
          "CPT",
          "CIP",
          "CFR",
          "CIF"
        ]
      }
    },
    {
      "id": 10,
      "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
      "rate": 102,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "seller": [
          "DAP",
          "DPU",
          "DDP"
        ],
        "common": [
          "CPT",
          "CIP"
        ]
      }
    },
    {
      "id": 11,
      "name": "Импортное таможенное оформление",
      "rate": 400,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA",
          "CPT",
          "CIP",
          "DAP",
          "DPU",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "seller": [
          "DDP"
        ],
        "common": []
      }
    },
    {
      "id": 12,
      "name": "Перевозка до места назначения ",
      "rate": 223,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "seller": [
          "DAP",
          "DPU",
          "DDP"
        ],
        "common": [
          "CPT",
          "CIP"
        ]
      }
    },
    {
      "id": 13,
      "name": "Выгрузка из транспортного средства в месте назначения",
      "rate": 102,
      "bet_pattern": {
        "buyer": [
          "EXW",
          "FCA",
          "DAP",
          "DDP",
          "FAS",
          "FOB",
          "CFR",
          "CIF"
        ],
        "seller": [
          "DPU"
        ],
        "common": [
          "CPT",
          "CIP"
        ]
      }
    }
  ],
  "test_index": 0,
  "common_bets_ids_chosen_by_seller": {},
  "describe_option": None,
  "options_comparison": {
    "EXW": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 2949,
      "delivery_price_buyer": 2253,
      "total": 5202
    },
    "FCA": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 3256,
      "delivery_price_buyer": 1946,
      "total": 5202
    },
    "CPT": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "COMMON"
        }
      ],
      "agreement_price_seller": 4282,
      "delivery_price_buyer": 920,
      "total": 5202
    },
    "CIP": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 8,
          "name": "Страхование",
          "rate": 29,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "COMMON"
        }
      ],
      "agreement_price_seller": 4311,
      "delivery_price_buyer": 920,
      "total": 5231
    },
    "DAP": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 4700,
      "delivery_price_buyer": 502,
      "total": 5202
    },
    "DPU": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "SELLER",
          "type": "SELLER"
        }
      ],
      "agreement_price_seller": 4802,
      "delivery_price_buyer": 400,
      "total": 5202
    },
    "DDP": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 7,
          "name": "Основная перевозка",
          "rate": 536,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 5100,
      "delivery_price_buyer": 102,
      "total": 5202
    },
    "FAS": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 6,
          "name": "Основная перевозка (морской фрахт)",
          "rate": 435,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 3642,
      "delivery_price_buyer": 1459,
      "total": 5101
    },
    "FOB": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 6,
          "name": "Основная перевозка (морской фрахт)",
          "rate": 435,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 3746,
      "delivery_price_buyer": 1355,
      "total": 5101
    },
    "CFR": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 6,
          "name": "Основная перевозка (морской фрахт)",
          "rate": 435,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 4181,
      "delivery_price_buyer": 920,
      "total": 5101
    },
    "CIF": {
      "bets": [
        {
          "id": 0,
          "name": "Упаковка и маркировка товара на складе продавца",
          "rate": 49,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 1,
          "name": "Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)",
          "rate": 90,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 2,
          "name": "Внутренняя перевозка",
          "rate": 203,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 3,
          "name": "Выгрузка с транспортного средства внутренней перевозки",
          "rate": 93,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 4,
          "name": "Экспортное таможенное оформление",
          "rate": 307,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 5,
          "name": "Погрузка на транспортное средство основной перевозки (Main Carriage)",
          "rate": 104,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 6,
          "name": "Основная перевозка (морской фрахт)",
          "rate": 435,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 8,
          "name": "Страхование",
          "rate": 29,
          "chosen_by": "SELLER",
          "type": "SELLER"
        },
        {
          "id": 9,
          "name": "Выгрузка с транспортного средства основной перевозки ",
          "rate": 93,
          "chosen_by": "BUYER",
          "type": "COMMON"
        },
        {
          "id": 10,
          "name": "Погрузка на транспортное средство перевозки до места назначения (On-carriage)",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 11,
          "name": "Импортное таможенное оформление",
          "rate": 400,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 12,
          "name": "Перевозка до места назначения ",
          "rate": 223,
          "chosen_by": "BUYER",
          "type": "BUYER"
        },
        {
          "id": 13,
          "name": "Выгрузка из транспортного средства в месте назначения",
          "rate": 102,
          "chosen_by": "BUYER",
          "type": "BUYER"
        }
      ],
      "agreement_price_seller": 4210,
      "delivery_price_buyer": 920,
      "total": 5130
    }
  },
  "chosen_option": {
    "agreement_price_seller": 3256,
    "delivery_price_buyer": 1946,
    "total": 5202,
    "incoterm": "FCA"
  },
  "tests": [
    [
      {
        "id": 43,
        "question": "Для каких видов перевозок подходит базис поставки DAP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Только морские и речные",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 45,
        "question": "Какие обязанности ложатся на продавца при DAP? ",
        "multiple_options": True,
        "right_ids": [
          2,
          0,
          4,
          3,
          1
        ],
        "options": [
          {
            "id": 5,
            "value": "Страхует груз от транспортных рисков покупателя",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 7,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Доставляет товар в назначенное место",
            "is_correct": True
          },
          {
            "id": 6,
            "value": "Выгружает товар",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Загружает в транспорт, который сам нанял",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 4,
        "question": "В каких документах прописываются условия поставки Инкотермс?",
        "multiple_options": True,
        "right_ids": [
          0,
          2,
          1
        ],
        "options": [
          {
            "id": 0,
            "value": "Контракт",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Таможенная декларация",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Товарная накладная",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Транзитная декларация",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Инвойс",
            "is_correct": True
          }
        ],
        "incoterm": None
      },
      {
        "id": 9,
        "question": "Выберите правильный вариант записи условия Инкотермс",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "FOB Incoterms 2020 Shanghai",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "FOB Shanghai Incoterms 2020",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Shanghai FOB Incoterms 2020",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 48,
        "question": "Особенность базиса поставки DPU?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Риск порчи товара в ходе всей перевозки несёт продавец. Риск переходит в пункте назначения",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходит от продавца к покупателю в момент погрузки товара на транспорт покупателя",
            "is_correct": False
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 15,
        "question": "Для каких видов перевозок подходит базис поставки FCA?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Морские и речные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          }
        ],
        "incoterm": "FCA"
      },
      {
        "id": 42,
        "question": "Какие обязанности ложатся на покупателя при CPT?",
        "multiple_options": True,
        "right_ids": [
          2,
          3
        ],
        "options": [
          {
            "id": 0,
            "value": "Загружает на транспортное средство ",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет импортное таможенное оформление ",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Страхует груз от транспортных рисков",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Выгружает товар в месте назначения",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          }
        ],
        "incoterm": "CPT"
      },
      {
        "id": 5,
        "question": "Что такое базисные условия поставки Инкотермс?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Торговые термины, определяющие условия поставки товаров от продавца покупателю",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Условия выполнения договора поставки между грузовладельцем и перевозчиком",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Правила, определяющие перспективы развития грузообразующих отраслей с целью формирования сбалансированного товарообмена в стране",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Условия обеспечение оптимизации использования транспортных ресурсов в системе ценообразования на товары и услуги",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 2,
        "question": "Что включают в себя правила Инкотермс?",
        "multiple_options": True,
        "right_ids": [
          1,
          0,
          2
        ],
        "options": [
          {
            "id": 1,
            "value": "Ответственность продавца и покупателя при транспортировке",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Права интеллектуальной собственности и разрешения споров в случае их нарушения",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Обязанности продавца и покупателя",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Последствия просрочки и других нарушений договора",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Как разделяются расходы на транспортировку между продавцом и покупателем",
            "is_correct": True
          }
        ],
        "incoterm": None
      },
      {
        "id": 33,
        "question": "Какие обязанности ложатся на продавца при CIF? ",
        "multiple_options": True,
        "right_ids": [
          4,
          5,
          2,
          3,
          0,
          1
        ],
        "options": [
          {
            "id": 7,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Фрахтует на судне и оплачивает транспортировку",
            "is_correct": True
          },
          {
            "id": 5,
            "value": "Страхует груз от транспортных рисков покупателя",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 6,
            "value": "Выгружает товар с судна",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Доставляет товар в порт и загружает на судно",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          }
        ],
        "incoterm": "CIF"
      },
      {
        "id": 46,
        "question": "Какие обязанности ложатся на покупателя при DAP? ",
        "multiple_options": True,
        "right_ids": [
          0,
          1
        ],
        "options": [
          {
            "id": 2,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Выгружает товар из транспорта продавца",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Страхует груз",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 20,
        "question": "Особенность базиса поставки FAS?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Риски случайной гибели товара переходят от поставщика к покупателю после погрузки на судно, и покупатель несёт все расходы с этого момента",
            "is_correct": False
          }
        ],
        "incoterm": "FAS"
      },
      {
        "id": 44,
        "question": "Особенность базиса поставки DAP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск от продавца к покупателю переходит в пункте назначения",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходит от продавца к покупателю в момент погрузки товара на транспорт покупателя",
            "is_correct": False
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 18,
        "question": "Какие обязанности ложатся на покупателя при FCA?",
        "multiple_options": True,
        "right_ids": [
          0,
          1
        ],
        "options": [
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Страхует товар в ходе всей основной перевозки.",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Организовывает основную перевозку: из места загрузки до своего склада",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Загружает товар на транспорт покупателя",
            "is_correct": False
          }
        ],
        "incoterm": "FCA"
      },
      {
        "id": 30,
        "question": "Какие обязанности ложатся на покупателя при CFR?",
        "multiple_options": True,
        "right_ids": [
          0,
          1,
          2
        ],
        "options": [
          {
            "id": 3,
            "value": "Грузит товар на судно",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Выгружает товар с судна",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Доставляет товар из порта до своего склада",
            "is_correct": True
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 3,
        "question": "Запись об условиях поставки в документах на перевозку включает:",
        "multiple_options": True,
        "right_ids": [
          1,
          2
        ],
        "options": [
          {
            "id": 1,
            "value": "Географический пункт назначения",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Базис поставки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Редакцию Инкотермс",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Дату прибытия груза",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Данные о всех транспортируемых грузах и сопроводительных документах",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 24,
        "question": "Особенность базиса поставки FOB?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Риски случайной гибели товара переходят от поставщика к покупателю после погрузки на судно, и покупатель несёт все расходы с этого момента",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения",
            "is_correct": False
          }
        ],
        "incoterm": "FOB"
      },
      {
        "id": 28,
        "question": "Особенность базиса поставки CFR?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риски переходят на складе продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риски случайной гибели товара переходят от поставщика к покупателю после погрузки на судно. Расходы по доставке на покупателя не переходят с этого момента, доставку оплачивает поставщик",
            "is_correct": True
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 32,
        "question": "Особенность базиса поставки CIF?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Риски переходят в пункте назначения",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск переходит в момент размещения продавцом товара на судне",
            "is_correct": True
          }
        ],
        "incoterm": "CIF"
      },
      {
        "id": 39,
        "question": "Для каких видов перевозок подходит базис поставки CPT?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Только морские и речные",
            "is_correct": False
          }
        ],
        "incoterm": "CPT"
      }
    ],
    [
      {
        "id": 9,
        "question": "Выберите правильный вариант записи условия Инкотермс",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "FOB Shanghai Incoterms 2020",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "FOB Incoterms 2020 Shanghai",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Shanghai FOB Incoterms 2020",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 19,
        "question": "Для каких видов перевозок подходит базис поставки FAS?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Только морские и речные",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Любой вид перевозок",
            "is_correct": False
          }
        ],
        "incoterm": "FAS"
      },
      {
        "id": 1,
        "question": "Для чего нужны правила Инкотермс?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Описать обязанности, разграничить риски и затраты продавца и покупателя",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Обеспечить сбалансированность объёмов производства и других ресурсов с размерами потребления определённых видов продукции",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Обеспечить рациональность использования транспортных ресурсов и оптимизацию транспортного фактора",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 29,
        "question": "Какие обязанности ложатся на продавца при CFR?",
        "multiple_options": True,
        "right_ids": [
          2,
          0,
          3,
          4,
          1
        ],
        "options": [
          {
            "id": 6,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 5,
            "value": "Выгружает товар с судна",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Доставляет товар в порт и загружает на судно",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Фрахтует на судне и оплачивает транспортировку",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 45,
        "question": "Какие обязанности ложатся на продавца при DAP? ",
        "multiple_options": True,
        "right_ids": [
          3,
          0,
          2,
          1,
          4
        ],
        "options": [
          {
            "id": 3,
            "value": "Загружает в транспорт, который сам нанял",
            "is_correct": True
          },
          {
            "id": 7,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 6,
            "value": "Выгружает товар",
            "is_correct": False
          },
          {
            "id": 5,
            "value": "Страхует груз от транспортных рисков покупателя",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Доставляет товар в назначенное место",
            "is_correct": True
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 49,
        "question": "Какие обязанности ложатся на продавца при DPU?",
        "multiple_options": True,
        "right_ids": [
          2,
          1,
          0,
          3,
          4
        ],
        "options": [
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 5,
            "value": "Страхует груз от транспортных рисков покупателя",
            "is_correct": False
          },
          {
            "id": 6,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Загружает в транспорт, который сам нанял",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Доставляет товар в назначенное место и выгружает его",
            "is_correct": True
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 35,
        "question": "Для каких видов перевозок подходит базис поставки CIP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Только морские и речные",
            "is_correct": False
          }
        ],
        "incoterm": "CIP"
      },
      {
        "id": 13,
        "question": "Какие обязанности ложатся на продавца при EXW?",
        "multiple_options": True,
        "right_ids": [
          0,
          2,
          1
        ],
        "options": [
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Предоставляет доступ к товару перевозчику, которого нанял покупатель",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Загружает товар на транспорт покупателя",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          }
        ],
        "incoterm": "EXW"
      },
      {
        "id": 11,
        "question": "Для каких видов перевозок подходит базис поставки EXW?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Морские и речные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          }
        ],
        "incoterm": "EXW"
      },
      {
        "id": 40,
        "question": "Особенность базиса поставки CPT",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Все риски и расходы несёт продавец",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риски утраты и гибели товара переходят с продавца на покупателя в момент передачи товара первому перевозчику или предоставления товара",
            "is_correct": True
          }
        ],
        "incoterm": "CPT"
      },
      {
        "id": 48,
        "question": "Особенность базиса поставки DPU?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходит от продавца к покупателю в момент погрузки товара на транспорт покупателя",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск порчи товара в ходе всей перевозки несёт продавец. Риск переходит в пункте назначения",
            "is_correct": True
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 46,
        "question": "Какие обязанности ложатся на покупателя при DAP? ",
        "multiple_options": True,
        "right_ids": [
          0,
          1
        ],
        "options": [
          {
            "id": 0,
            "value": "Выгружает товар из транспорта продавца",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Страхует груз",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 6,
        "question": "На какие 4 группы в зависимости от участия продавца и покупателя делятся базисы поставки?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 3,
            "value": "R,S,P,Q",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Y,Z,W,X",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "C,D,A,B",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "E,F,C,D",
            "is_correct": True
          }
        ],
        "incoterm": None
      },
      {
        "id": 54,
        "question": "Какие обязанности ложатся на покупателя при DDP? ",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 3,
            "value": "Страхует груз",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Выгружает товар из транспорта продавца",
            "is_correct": True
          }
        ],
        "incoterm": "DDP"
      },
      {
        "id": 38,
        "question": "Какие обязанности ложатся на покупателя при CIP?",
        "multiple_options": True,
        "right_ids": [
          1,
          0,
          2
        ],
        "options": [
          {
            "id": 3,
            "value": "Грузит товар на судно",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Выгружает товар с транспорта продавца",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Доставляет товар из пункта назначения до своего склада",
            "is_correct": True
          }
        ],
        "incoterm": "CIP"
      },
      {
        "id": 34,
        "question": "Какие обязанности ложатся на покупателя при CIF? ",
        "multiple_options": True,
        "right_ids": [
          2,
          1,
          0
        ],
        "options": [
          {
            "id": 3,
            "value": "Грузит товар на судно",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Доставляет товар из порта до своего склада",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Выгружает товар с судна",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          }
        ],
        "incoterm": "CIF"
      },
      {
        "id": 21,
        "question": "Какие обязанности ложатся на продавца при FAS?",
        "multiple_options": True,
        "right_ids": [
          2,
          1,
          0,
          3
        ],
        "options": [
          {
            "id": 5,
            "value": "Загружает товар на судно покупателя",
            "is_correct": False
          },
          {
            "id": 4,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Доставляет товар в порт и выгружает рядом с бортом судна",
            "is_correct": True
          }
        ],
        "incoterm": "FAS"
      },
      {
        "id": 27,
        "question": "Для каких видов перевозок подходит базис поставки CFR?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Любой вид перевозок",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Только морские и речные",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 15,
        "question": "Для каких видов перевозок подходит базис поставки FCA?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Морские и речные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          }
        ],
        "incoterm": "FCA"
      },
      {
        "id": 17,
        "question": "Какие обязанности ложатся на продавца при FCA?",
        "multiple_options": True,
        "right_ids": [
          0,
          2,
          1,
          3
        ],
        "options": [
          {
            "id": 5,
            "value": "Выгружает товар из транспорта продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Загружает товар на транспорт покупателя",
            "is_correct": True
          }
        ],
        "incoterm": "FCA"
      }
    ],
    [
      {
        "id": 31,
        "question": "Для каких видов перевозок подходит базис поставки CIF?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Любой вид перевозок",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Только морские и речные",
            "is_correct": True
          }
        ],
        "incoterm": "CIF"
      },
      {
        "id": 48,
        "question": "Особенность базиса поставки DPU?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходит от продавца к покупателю в момент погрузки товара на транспорт покупателя",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск порчи товара в ходе всей перевозки несёт продавец. Риск переходит в пункте назначения",
            "is_correct": True
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 42,
        "question": "Какие обязанности ложатся на покупателя при CPT?",
        "multiple_options": True,
        "right_ids": [
          3,
          2
        ],
        "options": [
          {
            "id": 4,
            "value": "Страхует груз от транспортных рисков",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Загружает на транспортное средство ",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Выгружает товар в месте назначения",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Осуществляет импортное таможенное оформление ",
            "is_correct": True
          }
        ],
        "incoterm": "CPT"
      },
      {
        "id": 44,
        "question": "Особенность базиса поставки DAP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходит от продавца к покупателю в момент погрузки товара на транспорт покупателя",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск от продавца к покупателю переходит в пункте назначения",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 35,
        "question": "Для каких видов перевозок подходит базис поставки CIP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Только морские и речные",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          }
        ],
        "incoterm": "CIP"
      },
      {
        "id": 50,
        "question": "Какие обязанности ложатся на покупателя при DPU?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Страхует груз",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Загружает груз на транспорт",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 34,
        "question": "Какие обязанности ложатся на покупателя при CIF? ",
        "multiple_options": True,
        "right_ids": [
          2,
          1,
          0
        ],
        "options": [
          {
            "id": 4,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Доставляет товар из порта до своего склада",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Выгружает товар с судна",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Грузит товар на судно",
            "is_correct": False
          }
        ],
        "incoterm": "CIF"
      },
      {
        "id": 41,
        "question": "Какие обязанности ложатся на продавца при CPT? ",
        "multiple_options": True,
        "right_ids": [
          0,
          1,
          2,
          6,
          3
        ],
        "options": [
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Загружает на транспортное средство",
            "is_correct": True
          },
          {
            "id": 5,
            "value": "Выгружает товар в месте назначения",
            "is_correct": False
          },
          {
            "id": 6,
            "value": "Страхует груз от транспортных рисков",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Осуществляет импортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          }
        ],
        "incoterm": "CPT"
      },
      {
        "id": 11,
        "question": "Для каких видов перевозок подходит базис поставки EXW?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Морские и речные перевозки",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          }
        ],
        "incoterm": "EXW"
      },
      {
        "id": 29,
        "question": "Какие обязанности ложатся на продавца при CFR?",
        "multiple_options": True,
        "right_ids": [
          3,
          4,
          1,
          0,
          2
        ],
        "options": [
          {
            "id": 3,
            "value": "Доставляет товар в порт и загружает на судно",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Фрахтует на судне и оплачивает транспортировку",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Маркирует",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Упаковывает товар",
            "is_correct": True
          },
          {
            "id": 5,
            "value": "Выгружает товар с судна",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": True
          },
          {
            "id": 6,
            "value": "Оформляет таможенный импорт",
            "is_correct": False
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 20,
        "question": "Особенность базиса поставки FAS?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Риски случайной гибели товара переходят от поставщика к покупателю после погрузки на судно, и покупатель несёт все расходы с этого момента",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения",
            "is_correct": False
          }
        ],
        "incoterm": "FAS"
      },
      {
        "id": 3,
        "question": "Запись об условиях поставки в документах на перевозку включает:",
        "multiple_options": True,
        "right_ids": [
          2,
          1
        ],
        "options": [
          {
            "id": 4,
            "value": "Данные о всех транспортируемых грузах и сопроводительных документах",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Редакцию Инкотермс",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "Географический пункт назначения",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Базис поставки",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "Дату прибытия груза",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 7,
        "question": "В каких группах базисов поставки покупатель участвует в основной поставке?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "E и F",
            "is_correct": True
          },
          {
            "id": 1,
            "value": "C и D",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "E, F, C, D",
            "is_correct": False
          },
          {
            "id": 3,
            "value": "E, F, C",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 47,
        "question": "Для каких видов перевозок подходит базис поставки DPU?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 0,
            "value": "Любой вид перевозок",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Авиационные перевозки",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Автомобильные перевозки",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Только морские и речные",
            "is_correct": False
          }
        ],
        "incoterm": "DPU"
      },
      {
        "id": 36,
        "question": "Особенность базиса поставки CIP?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 2,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риск переходит после передачи продавцом товара перевозчику, а не в пункте назначения. Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков. При этом страхует груз от транспортных рисков покупателя",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Риски переходят в пункте назначения",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Риск переходит в момент размещения продавцом товара на судне",
            "is_correct": False
          }
        ],
        "incoterm": "CIP"
      },
      {
        "id": 2,
        "question": "Что включают в себя правила Инкотермс?",
        "multiple_options": True,
        "right_ids": [
          0,
          1,
          2
        ],
        "options": [
          {
            "id": 0,
            "value": "Обязанности продавца и покупателя",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Права интеллектуальной собственности и разрешения споров в случае их нарушения",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Ответственность продавца и покупателя при транспортировке",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Как разделяются расходы на транспортировку между продавцом и покупателем",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Последствия просрочки и других нарушений договора",
            "is_correct": False
          }
        ],
        "incoterm": None
      },
      {
        "id": 46,
        "question": "Какие обязанности ложатся на покупателя при DAP? ",
        "multiple_options": True,
        "right_ids": [
          1,
          0
        ],
        "options": [
          {
            "id": 3,
            "value": "Страхует груз",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 0,
            "value": "Выгружает товар из транспорта продавца",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Оформляет таможенный экспорт",
            "is_correct": False
          }
        ],
        "incoterm": "DAP"
      },
      {
        "id": 28,
        "question": "Особенность базиса поставки CFR?",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Риск случайной гибели товара переходят от поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна",
            "is_correct": False
          },
          {
            "id": 2,
            "value": "Риски переходят на складе продавца",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риски случайной гибели товара переходят от поставщика к покупателю после погрузки на судно. Расходы по доставке на покупателя не переходят с этого момента, доставку оплачивает поставщик",
            "is_correct": True
          }
        ],
        "incoterm": "CFR"
      },
      {
        "id": 18,
        "question": "Какие обязанности ложатся на покупателя при FCA?",
        "multiple_options": True,
        "right_ids": [
          0,
          1
        ],
        "options": [
          {
            "id": 2,
            "value": "Осуществляет экспортное таможенное оформление",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Организовывает основную перевозку: из места загрузки до своего склада",
            "is_correct": True
          },
          {
            "id": 4,
            "value": "Страхует товар в ходе всей основной перевозки.",
            "is_correct": False
          },
          {
            "id": 1,
            "value": "Оформляет таможенный импорт",
            "is_correct": True
          },
          {
            "id": 3,
            "value": "Загружает товар на транспорт покупателя",
            "is_correct": False
          }
        ],
        "incoterm": "FCA"
      },
      {
        "id": 40,
        "question": "Особенность базиса поставки CPT",
        "multiple_options": False,
        "right_ids": [
          0
        ],
        "options": [
          {
            "id": 1,
            "value": "Все риски и расходы несёт продавец",
            "is_correct": False
          },
          {
            "id": 0,
            "value": "Риски утраты и гибели товара переходят с продавца на покупателя в момент передачи товара первому перевозчику или предоставления товара",
            "is_correct": True
          },
          {
            "id": 2,
            "value": "Риски случайной порчи товара переходят от продавца к покупателю на складе продавца",
            "is_correct": False
          }
        ],
        "incoterm": "CPT"
      }
    ]
  ]
}

doc = f"Классная работа PR1 Вариант:{event['id']}\n\n"
doc += f"Легенда: {event['legend']}\n\n"
doc += f"Логисты:\n"
for logist in event["logists"]:
    doc += f"Логист {logist['letter']}\n"
    doc += f"{logist['header']}\n"
    doc += f"{logist['body']}\n"
doc += '\n'
doc += f"Продукт - {event['product']}\n\n"
doc += f"Из - {event['from_country']}\n\n"
doc += f"В - {event['to_country']}\n\n"
doc += f"Стоимость товара - {event['product_price']}\n\n"

doc += f"Ставки: \n"
for bet in event["bets"]:
    doc += f"{bet['name']}: {bet['rate']};\n"
    if bet['bet_pattern']["seller"]:
        doc += f"Инкотермы продавец: {', '.join(bet['bet_pattern']['seller'])}\n"
    if bet['bet_pattern']["buyer"]:
        doc += f"Инкотермы покупатель: {', '.join(bet['bet_pattern']['buyer'])}\n"
    if bet['bet_pattern']["common"]:
        doc += f"Инкотермы общие: {', '.join(bet['bet_pattern']['common'])}\n"
    doc += '\n'


doc += f'Итоговые варианты инкотермов:\n'
for incoterm, info in event["options_comparison"].items():
    doc += f'Инкотерм: {incoterm}\n'
    doc += f"Выбранные ставки продавцом: {', '.join([bet['name'] + ': ' + str(bet['rate']) for bet in info['bets'] if bet['chosen_by'] == 'SELLER'])}\n"
    doc += f"Выбранные ставки покупателем: {', '.join([bet['name'] + ': ' + str(bet['rate']) for bet in info['bets'] if bet['chosen_by'] == 'BUYER'])}\n"
    doc += f"Контрактная стоимость продавца: {info['agreement_price_seller']}\n"
    doc += f"Контрактная стоимость покупателя: {info['delivery_price_buyer']}\n"
    doc += f"Итого: {info['total']}\n"
    doc += '\n'

with open('pr1_variant1.txt', 'w', encoding='utf-8') as file:
  file.write(str(doc))