import random
from typing import Optional

from pydantic import BaseModel

from schemas import TestQuestionPR1, Incoterm, PR1ControlInfo

raw_pr1_control_info = {
    'legends': [
        """В Выборг (Россия) из Бильбао (Испания) поставляется оливĸовое масло 
в бутылĸах. Договор оформляется на поставку морсĸим транспортом.

Цена производителя – {0} у.е. за бутылку

Размер партии {1} бутылок  

Бутылки на производстве упаковывают в коробки по 12 штук 
и комплектуют в транспортный пакет на поддоне. Отгружают партию товара на поддонах со склада производителя.

Транспортная упаковка товара - {2} у.е. за партию товара

Доставĸа товара до порта отгрузĸи – {3} у.е. 

Расходы на погрузку-разгрузку при транспортировке до причала – {4} у.е. 

Стоимость морской перевозки до порта назначения - {5} у.е.

Стоимость погрузĸи на борт судна в порту отправления - {6} у.е. 

Товар застрахован, расходы на страхование {7} у.е. 

Экспортные таможенные формальности и платежи - {8} у.е.

Сделĸа заĸлючена на условиях поставĸи {9}""",
        """В Москву (Россия) из Гамбурга (Германия) поставляется партия обуви. Договор заключен на {0} пар обуви за {1} у.е. за пару.

Продукция отгружается со склада продавца, упакована на поддонах. Стоимость упаковки включена в стоимость товара.

Поставка осуществляется из порта Гамбург в порт Калининград, 
а затем в Москву железнодорожным транспортом.

Экспортные таможенные формальности и платежи - {2} у.е.

Товар застрахован, расходы на страхование {3} у.е. 

Доставку до порта Калининград обеспечивает международный логистический провайдер за {4} у.е. с учетом доставки в порт Гамбург автомобильным транспортом, погрузки на судно, доставки в порт Калининград и выгрузки на терминале

Перевозку с терминала порта Калининград до терминала в Москве обеспечивает российская компания за {5} у.е. 

Сделĸа заĸлючена на условиях поставĸи {6}""",
        """Из Шанхая (Китай) в Хабаровск (Россия) ввозится партия телевизоров 
в количестве {0} штук по {1} у.е. за телевизор.

Товар отгружается со склада производителя в транспортной упаковке на поддонах.

Доставку до границы обеспечивает международный перевозчик 
по стоимости {2} у.е.

Доставку по территории России до места назначения обеспечивает логистический провайдер по стоимости {3} у.е. с учетом разгрузки в месте назначения

Экспортные таможенные формальности и платежи - {4} у.е. 

Импортные таможенные формальности и платежи - {5} у.е. 

Сделка заключена на условиях поставки {6}""",
    ],
    'random_incoterms': [
        [Incoterm.FOB.value, Incoterm.CFR.value, Incoterm.CIF.value],
        [Incoterm.FCA.value, Incoterm.CIP.value, Incoterm.CPT.value],
        [
            Incoterm.EXW.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
        ],
    ],
    'test_questions': [
        {
            'id': 1,
            'question': 'InCoTerms (Инкотермс)',
            'options': [
                {'id': 0, 'value': 'Международные торговые термины', 'is_correct': True},
                {'id': 1, 'value': 'Международные коммерческие правила'},
                {'id': 2, 'value': 'Международная торговая терминология'},
                {'id': 3, 'value': 'Международные коммерческие условия поставки'},
            ],
        },
        {
            'id': 2,
            'question': 'Инкотермс определяют',
            'options': [
                {
                    'id': 0,
                    'value': 'Обязанности продавца и покупателя, риск перехода ответственности, ответственность сторон за расходы',
                    'is_correct': True,
                },
                {'id': 1, 'value': 'Обязанности продавца, покупателя, перевозчика'},
                {'id': 2, 'value': 'Обязанности продавца и покупателя, риск перехода ответственности'},
                {'id': 3, 'value': 'Обязанности продавца и покупателя, какая из сторон отвечает за расходы'},
            ],
        },
        {
            'id': 3,
            'question': 'Базисные условия поставки Инкотермс',
            'options': [
                {
                    'id': 0,
                    'value': 'Определяют обязанности покупателя и продавца по доставке товара ',
                    'is_correct': True,
                },
                {
                    'id': 1,
                    'value': 'Устанавливают момент перехода риска повреждения товара или случайной утери',
                    'is_correct': True,
                },
                {
                    'id': 2,
                    'value': 'Описывают обязанности, риски, расходы продавцов и покупателей ',
                    'is_correct': True,
                },
                {'id': 3, 'value': 'Формируются на основе практики международной торговли', 'is_correct': True},
                {
                    'id': 4,
                    'value': 'Переиздаются и совершенствуются в зависимости от текущей ситуации',
                    'is_correct': True,
                },
            ],
        },
        {
            'id': 4,
            'question': 'Является ли Инкотермс\nс правовой точки зрения обязательным документом?',
            'options': [{'id': 0, 'value': 'Не является', 'is_correct': True}, {'id': 1, 'value': 'Является'},],
        },
        {
            'id': 5,
            'question': 'Что включает в себя Инкотермс 2020?',
            'options': [
                {'id': 0, 'value': '4 группы - 11 терминов ', 'is_correct': True},
                {'id': 1, 'value': '4 группы – 12 терминов'},
                {'id': 2, 'value': '4 группы – 10 терминов'},
                {'id': 3, 'value': '3 группы – 11 терминов'},
            ],
        },
        {
            'id': 6,
            'question': 'Как обозначается условие поставки «Свободно\nс завода»?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FCA'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 7,
            'question': 'Как обозначается условие поставки «Франко перевозчик»?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 8,
            'question': 'Как обозначается условие поставки «Свободно на борту»?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FCA'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 9,
            'question': 'Как обозначается условие поставки «Свободно вдоль борта судна»?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FCA'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 10,
            'question': 'Как обозначается условие поставки «Стоимость\nи фрахт»?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 11,
            'question': 'Как обозначается условие поставки «Перевозка и страхование оплачены до…»?',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CPT'},
                {'id': 2, 'value': 'CIF'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 12,
            'question': 'Как обозначается условие поставки «Перевозка оплачена до…»?',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CIP'},
                {'id': 2, 'value': 'CIF'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 13,
            'question': 'Как обозначается условие поставки «Стоимость, страхование и фрахт»?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CIP'},
                {'id': 2, 'value': 'CPT'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 14,
            'question': 'Как обозначается условие поставки «Поставка с уплатой пошлины»?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DPU'},
            ],
        },
        {
            'id': 15,
            'question': 'Как обозначается условие поставки «Поставка в пункте назначения»?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DDP'},
                {'id': 3, 'value': 'DPU'},
            ],
        },
        {
            'id': 16,
            'question': 'Как обозначается условие поставки «Поставка\nв место выгрузки»?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DDP'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 17,
            'question': 'По какому условию Группа Е Инкотермс обозначает максимальную ответственность продавца?',
            'options': [
                {'id': 0, 'value': 'Отгрузка', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Основная перевозка оплачена'},
                {'id': 3, 'value': 'Прибытие'},
            ],
        },
        {
            'id': 18,
            'question': 'Какое условие группа «F» Инкотермс возлагает\nна продавца?',
            'options': [
                {'id': 0, 'value': 'Основная перевозка не оплачена', 'is_correct': True},
                {'id': 1, 'value': 'Отгрузка'},
                {'id': 2, 'value': 'Основная перевозка оплачена'},
                {'id': 3, 'value': 'Прибытие'},
            ],
        },
        {
            'id': 19,
            'question': 'Какое условие группа «С» Инкотермс возлагает\nна продавца?',
            'options': [
                {'id': 0, 'value': 'Основная перевозка оплачена', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Отгрузка'},
                {'id': 3, 'value': 'Прибытие '},
            ],
        },
        {
            'id': 20,
            'question': 'По какому условию группа D Инкотермс обозначает максимальную ответственность продавца?',
            'options': [
                {'id': 0, 'value': 'Прибытие', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Отгрузка'},
                {'id': 3, 'value': 'Основная перевозка оплачена'},
            ],
        },
        {
            'id': 21,
            'question': 'Термины, применимые для любого вида транспорта ',
            'options': [
                {'id': 0, 'value': 'EXW, FCA, CIP, CPT,DDP, DAP, DPU', 'is_correct': True},
                {'id': 1, 'value': 'EXW, FCA, FOB, CPT,DDP, DAP, DPU'},
                {'id': 2, 'value': 'FOB, FAS, CFR, CIF, DDP, DAP'},
                {'id': 3, 'value': 'EXW, FCA, FOB, CPT, DDP, DPU'},
            ],
        },
        {
            'id': 22,
            'question': 'Термины, применимые только для морского\nи внутреннего водного транспорта ',
            'options': [
                {'id': 0, 'value': 'FOB, FAS, CFR, CIF', 'is_correct': True},
                {'id': 1, 'value': 'EXW, FCA, CIP, CPT'},
                {'id': 2, 'value': 'EXW, FCA, FOB, CPT'},
                {'id': 3, 'value': 'EXW, FCA, FOB, CFR'},
            ],
        },
        {
            'id': 23,
            'question': 'Какие термины обязывают страховать?',
            'options': [
                {'id': 0, 'value': 'CIF, CIP', 'is_correct': True},
                {'id': 1, 'value': 'FCA, FOB '},
                {'id': 2, 'value': 'CIF, FCA '},
                {'id': 3, 'value': 'CIP, FOB '},
            ],
        },
        {
            'id': 24,
            'question': 'Какой термин накладывает минимальную ответственность\nна продавца?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 25,
            'question': 'Какой термин накладывает максимальную ответственность\nна продавца?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 26,
            'question': 'В каком условии поставки продавец обязан предоставить готовый\nк отгрузке товар?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 27,
            'question': 'В каком условии поставки покупатель обязан выполнить экспортное, импортное таможенное оформление и доставить товар?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 28,
            'question': 'В каком условии поставки риски переходят в момент передачи товара\nна складе продавца?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 29,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи отгрузить товар перевозчику, назначенному покупателем?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 30,
            'question': 'В каком условии поставки покупатель обязан доставить товар\nи выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 31,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику\nна складе продавца?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 32,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи разместить товар в порту отгрузки вдоль борта судна указанного покупателем?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 33,
            'question': 'В каком условии поставки покупатель обязан погрузить товар на судно и доставить в порт разгрузки, а также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 34,
            'question': 'В каком условии поставки риски переходят в порту\nв момент размещения товара вдоль борта судна?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 35,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление и разместить товар в порту отгрузки и погрузить на борт судна, указанного покупателем?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 36,
            'question': 'В каком условии поставки покупатель обязан доставить товар в порт разгрузки, а также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 37,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, погрузить товар на борт судна и доставить в порт разгрузки?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 38,
            'question': 'В каком условии поставки покупатель обязан разгрузить и принять товар в порту разгрузки,\nа также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 39,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, застраховать, погрузить товар на борта судна\nи доставить в порт разгрузки?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 40,
            'question': 'В каком условии поставки покупатель обязан разгрузить и принять товар в порту разгрузки, а также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 41,
            'question': 'В каких условиях поставки риски переходят в порту отгрузки с момента полной погрузки на борт судна?',
            'options': [
                {'id': 0, 'value': 'FOB, CFR, CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR, CIF'},
                {'id': 2, 'value': 'FOB, CIF'},
                {'id': 3, 'value': 'FOB, CFR'},
            ],
        },
        {
            'id': 42,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, застраховать и доставить груз в согласованное место назначения?',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 43,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику на складе продавца? Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков. При этом страхует груз от транспортных рисков покупателя.',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 44,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи доставить груз\nв согласованное место назначения?',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 45,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику на складе продавца? Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков.',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 46,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи доставить груз\nдо согласованного пункта назначения?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 47,
            'question': 'В каком условии поставки риски переходят в пункте назначения?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 48,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, доставить товар до места назначения и выгрузить его?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 49,
            'question': 'В каких условиях поставки покупатель обязан принять товар и выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CIP CPT DAP DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP DPU'},
                {'id': 2, 'value': 'CIP CPT '},
                {'id': 3, 'value': 'DDP DPU'},
            ],
        },
        {
            'id': 50,
            'question': 'В каком условии поставки риски переходят в месте назначения после полной выгрузки?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 51,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, доставить груз\nдо согласованного места назначения и выполнить импортное таможенное оформление с уплатой пошлин?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 52,
            'question': 'В каком условии поставки покупатель обязан принять товар?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 53,
            'question': 'В каком условии поставки риски переходят в месте назначения и все риски несет продавец?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
    ],
}

pr1_control_info = PR1ControlInfo(**raw_pr1_control_info)
