from schemas import Incoterm, PR2ControlInfo

raw_pr2_control_info = {
    'legends': [
        """В Выборг (Россия) из Бильбао (Испания) поставляется оливĸовое масло в бутылĸах. Договор оформляется на поставку морсĸим транспортом.

Цена производителя – {0} у.е. за бутылку
Размер партии 5000 {1} бутылок  
В расчете учитывать Цена производителя = Цена производителя * размер партии 
Бутылки на производстве упаковывают в коробки по 12 штук и комплектуют в транспортный пакет на поддоне. 
Отгружают партию товара на поддонах со склада производителя. 
Транспортная упаковка товара - {2} у.е. за партию товара
Доставĸа товара до порта отгрузĸи – {3} у.е. 
Расходы на погрузку-разгрузку при транспортировке до причала – {4} у.е. 
Стоимость морской перевозки до порта назначения (Транспортные расходы до порта назначения) - {5} у.е.
Стоимость погрузĸи на борт судна в порту отправления (Погрузка на борт судна) - {6} у.е. 
Товар застрахован, расходы на страхование {7} у.е. 
Экспортные таможенные формальности и платежи - {8} у.е.

Сделĸа заĸлючена на условиях поставĸи {9}""",
        """В Москву (Россия) из Гамбурга (Германия) поставляется партия обуви. Договор заключен на {0} пар обуви за {1} у.е. за пару. Продукция отгружается со склада продавца, упакованной на поддонах. Стоимость упаковки включена в стоимость товара. (Означает Цена производителя + Упаковка + Проверка товара)
Поставка осуществляется из порта Гамбург в порт Калининград, а затем в Москву железнодорожным транспортом. 
Экспортные таможенные формальности и платежи - {2} у.е. 
Товар застрахован, расходы на страхование {3} у.е. 
Доставку до порта Калининград обеспечивает международный логистический провайдер за {4} у.е. с учетом доставки в порт Гамбург автомобильным транспортом, погрузки на судно, доставки в порт Калининград и выгрузки на терминале (Означает Расходы на погрузку + Доставка товара перевозчику)
Перевозку с терминала порта Калининград до терминала в Москве обеспечивает российская компания за {5} у.е. 

Сделĸа заĸлючена на условиях поставĸи {6}""",
        """Из Шанхая (Китай) в Хабаровск (Россия) ввозится партия телевизоров в количестве {0} штук
по {1} у.е. за телевизор. Товар отгружается со склада производителя в транспортной упаковке на поддонах.(Означает Цена производителя + Упаковка + Проверка товара)
Доставку до границы обеспечивает международный перевозчик по стоимости {2} у.е.  (Означает Доставка товара перевозчику)
Доставку по территории России до места назначения обеспечивает логистический провайдер по стоимости {3} у.е. (Означает Транспортные расходы до места назначения) с учетом разгрузки в месте назначения
Экспортные таможенные формальности и платежи - {4} у.е. 
Импортные таможенные формальности и платежи - {5} у.е. 

Сделка заключена на условиях поставки {6}""",
    ],
    'random_incoterms': [
        [Incoterm.FOB.value, Incoterm.CFR.value, Incoterm.CIF.value],
        [Incoterm.FCA.value, Incoterm.CIP.value, Incoterm.CPT.value],
        [
            Incoterm.EXW.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DDP.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
            Incoterm.DPU.value,
        ],
    ],
    'steps': ['PR2_CONTROL_1', 'PR2_CONTROL_2', 'PR2_CONTROL_3',],
}

pr2_control_info = PR2ControlInfo(**raw_pr2_control_info)
