# -*- coding: utf8 -*-
from schemas import PR1ClassInfo, Incoterm

raw_practice_one_info = {
    'bets': [
        {
            'id': 0,
            'name': 'Упаковка и маркировка товара на складе продавца',
            'value_percentage': {'min': 1, 'max': 2},
            'incoterms': {
                'buyer': [],
                'seller': ['EXW', 'FCA', 'CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF',],
                'common': [],
            },
        },
        {
            'id': 1,
            'name': 'Погрузка на транспортное средство внутренней перевозки (Pre-Carriage)',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW'],
                'seller': ['CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF',],
                'common': ['FCA'],
            },
        },
        {
            'id': 2,
            'name': 'Внутренняя перевозка',
            'value_percentage': {'min': 6, 'max': 8},
            'incoterms': {
                'buyer': ['EXW'],
                'seller': ['CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF',],
                'common': ['FCA'],
            },
        },
        {
            'id': 3,
            'name': 'Выгрузка с транспортного средства внутренней перевозки',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW'],
                'seller': ['CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF',],
                'common': ['FCA'],
            },
        },
        {
            'id': 4,
            'name': 'Экспортное таможенное оформление',
            'value_percentage': {'min': 10, 'max': 15},
            'incoterms': {
                'buyer': ['EXW'],
                'seller': ['FCA', 'CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF',],
                'common': [],
            },
        },
        {
            'id': 5,
            'name': 'Погрузка на транспортное средство основной перевозки (Main Carriage)',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW', 'FAS'],
                'seller': ['CPT', 'CIP', 'DAP', 'DPU', 'DDP', 'FOB', 'CFR', 'CIF'],
                'common': ['FCA'],
            },
        },
        {
            'id': 6,
            'name': 'Основная перевозка (морской фрахт)',
            'value_percentage': {'min': 15, 'max': 15},
            'incoterms': {'buyer': ['FAS', 'FOB'], 'seller': ['CFR', 'CIF'], 'common': [],},
        },
        {
            'id': 7,
            'name': 'Основная перевозка',  # (наземная, авиа)
            'value_percentage': {'min': 15, 'max': 20},
            'incoterms': {'buyer': ['EXW', 'FCA'], 'seller': ['CPT', 'CIP', 'DAP', 'DPU', 'DDP'], 'common': [],},
        },
        {
            'id': 8,
            'name': 'Страхование',
            'value_percentage': {'min': 1, 'max': 1},
            'incoterms': {'buyer': [], 'seller': ['CIP', 'CIF'], 'common': []},
        },
        {
            'id': 9,
            'name': 'Выгрузка с транспортного средства основной перевозки ',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW', 'FCA', 'FAS', 'FOB'],
                'seller': ['DAP', 'DPU', 'DDP'],
                'common': ['CPT', 'CIP', 'CFR', 'CIF'],
            },
        },
        {
            'id': 10,
            'name': 'Погрузка на транспортное средство перевозки\nдо места назначения (On-carriage)',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW', 'FCA', 'FAS', 'FOB', 'CFR', 'CIF'],
                'seller': ['DAP', 'DPU', 'DDP'],
                'common': ['CPT', 'CIP'],
            },
        },
        {
            'id': 11,
            'name': 'Импортное таможенное оформление',
            'value_percentage': {'min': 10, 'max': 15},
            'incoterms': {
                'buyer': ['EXW', 'FCA', 'CPT', 'CIP', 'DAP', 'DPU', 'FAS', 'FOB', 'CFR', 'CIF',],
                'seller': ['DDP'],
                'common': [],
            },
        },
        {
            'id': 12,
            'name': 'Перевозка до места назначения ',
            'value_percentage': {'min': 6, 'max': 8},
            'incoterms': {
                'buyer': ['EXW', 'FCA', 'FAS', 'FOB', 'CFR', 'CIF'],
                'seller': ['DAP', 'DPU', 'DDP'],
                'common': ['CPT', 'CIP'],
            },
        },
        {
            'id': 13,
            'name': 'Выгрузка из транспортного средства в месте назначения',
            'value_percentage': {'min': 3, 'max': 4},
            'incoterms': {
                'buyer': ['EXW', 'FCA', 'DAP', 'DDP', 'FAS', 'FOB', 'CFR', 'CIF'],
                'seller': ['DPU'],
                'common': ['CPT', 'CIP'],
            },
        },
    ],
    'steps': [
        {'id': 0, 'code': 'SELECT_LOGIST', 'name': 'ВЫБОР ЛОГИСТА', 'role': 'ALL'},
        {'id': 1, 'code': 'EXW_SELLER', 'name': 'EXW: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 2, 'code': 'EXW_BUYER', 'name': 'EXW: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 3, 'code': 'FCA_SELLER', 'name': 'FCA: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 4, 'code': 'FCA_BUYER', 'name': 'FCA: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 5, 'code': 'FAS_SELLER', 'name': 'FAS: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 6, 'code': 'FAS_BUYER', 'name': 'FAS: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 7, 'code': 'FOB_SELLER', 'name': 'FOB: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 8, 'code': 'FOB_BUYER', 'name': 'FOB: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 9, 'code': 'CFR_SELLER', 'name': 'CFR: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 10, 'code': 'CFR_BUYER', 'name': 'CFR: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 11, 'code': 'CIF_SELLER', 'name': 'CIF: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 12, 'code': 'CIF_BUYER', 'name': 'CIF: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 15, 'code': 'CIP_SELLER', 'name': 'CIP: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 16, 'code': 'CIP_BUYER', 'name': 'CIP: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 13, 'code': 'CPT_SELLER', 'name': 'CPT: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 14, 'code': 'CPT_BUYER', 'name': 'CPT: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 17, 'code': 'DAP_SELLER', 'name': 'DAP: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 18, 'code': 'DAP_BUYER', 'name': 'DAP: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 19, 'code': 'DPU_SELLER', 'name': 'DPU: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 20, 'code': 'DPU_BUYER', 'name': 'DPU: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 21, 'code': 'DDP_SELLER', 'name': 'DDP: ВЫБОР ПРОДАВЦА', 'role': 'SELLER',},
        {'id': 22, 'code': 'DDP_BUYER', 'name': 'DDP: ВЫБОР ПОКУПАТЕЛЯ', 'role': 'BUYER',},
        {'id': 23, 'code': 'OPTIONS_COMPARISON', 'name': 'Сравнение инкотермов', 'role': 'ALL',},
        {'id': 24, 'code': 'CONDITIONS_SELECTION', 'name': 'Согласование условий поставки', 'role': 'ALL',},
        {'id': 25, 'code': 'DESCRIBE_OPTION', 'name': 'Обоснование выбора', 'role': 'ALL',},
        # {'id': 26, 'code': 'TEST_1', 'name': 'Тестовый вопрос №1', 'role': 'ALL'},
        # {'id': 27, 'code': 'TEST_2', 'name': 'Тестовый вопрос №2', 'role': 'ALL'},
        # {'id': 28, 'code': 'TEST_3', 'name': 'Тестовый вопрос №3', 'role': 'ALL'},
        # {'id': 29, 'code': 'TEST_4', 'name': 'Тестовый вопрос №4', 'role': 'ALL'},
        # {'id': 30, 'code': 'TEST_5', 'name': 'Тестовый вопрос №5', 'role': 'ALL'},
        # {'id': 31, 'code': 'TEST_6', 'name': 'Тестовый вопрос №6', 'role': 'ALL'},
        # {'id': 32, 'code': 'TEST_7', 'name': 'Тестовый вопрос №7', 'role': 'ALL'},
        # {'id': 33, 'code': 'TEST_8', 'name': 'Тестовый вопрос №8', 'role': 'ALL'},
        # {'id': 34, 'code': 'TEST_9', 'name': 'Тестовый вопрос №9', 'role': 'ALL'},
        # {'id': 35, 'code': 'TEST_10', 'name': 'Тестовый вопрос №10', 'role': 'ALL'},
        # {'id': 36, 'code': 'TEST_11', 'name': 'Тестовый вопрос №11', 'role': 'ALL'},
        # {'id': 37, 'code': 'TEST_12', 'name': 'Тестовый вопрос №12', 'role': 'ALL'},
        # {'id': 38, 'code': 'TEST_13', 'name': 'Тестовый вопрос №13', 'role': 'ALL'},
        # {'id': 39, 'code': 'TEST_14', 'name': 'Тестовый вопрос №14', 'role': 'ALL'},
        # {'id': 40, 'code': 'TEST_15', 'name': 'Тестовый вопрос №15', 'role': 'ALL'},
        # {'id': 41, 'code': 'TEST_16', 'name': 'Тестовый вопрос №16', 'role': 'ALL'},
        # {'id': 42, 'code': 'TEST_17', 'name': 'Тестовый вопрос №17', 'role': 'ALL'},
        # {'id': 43, 'code': 'TEST_18', 'name': 'Тестовый вопрос №18', 'role': 'ALL'},
        # {'id': 44, 'code': 'TEST_19', 'name': 'Тестовый вопрос №19', 'role': 'ALL'},
        # {'id': 45, 'code': 'TEST_20', 'name': 'Тестовый вопрос №20', 'role': 'ALL'},
    ],
    'legend_pattern': 'Российский Покупатель рассматривает заключение контракта\nс иностранным Продавцом\nна поставку партии\nтовара ({0}) из {1} в {2}. Стоимость партии товара – {3} у.е.',
    'classic_test_questions': {
        'first_block': [
            {
                'id': 1,
                'question': 'Для чего нужны правила Инкотермс?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Описать обязанности, разграничить риски и затраты продавца и покупателя',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Обеспечить рациональность использования транспортных ресурсов и оптимизацию транспортного фактора',
                    },
                    {
                        'id': 2,
                        'value': 'Обеспечить сбалансированность объёмов производства и других ресурсов с размерами потребления определённых видов продукции',
                    },
                ],
            },
            {
                'id': 2,
                'question': 'Что включают в себя правила Инкотермс?',
                'options': [
                    {'id': 0, 'value': 'Обязанности продавца и покупателя', 'is_correct': True,},
                    {
                        'id': 1,
                        'value': 'Ответственность продавца и покупателя\nпри транспортировке',
                        'is_correct': True,
                    },
                    {
                        'id': 2,
                        'value': 'Как разделяются расходы на транспортировку между продавцом и покупателем',
                        'is_correct': True,
                    },
                    {'id': 3, 'value': 'Последствия просрочки и других нарушений договора'},
                    {
                        'id': 4,
                        'value': 'Права интеллектуальной собственности\nи разрешения споров в случае их нарушения',
                    },
                ],
            },
            {
                'id': 3,
                'question': 'Запись об условиях поставки в документах\nна перевозку включает:',
                'options': [
                    {'id': 0, 'value': 'Базис поставки', 'is_correct': True},
                    {'id': 1, 'value': 'Географический пункт назначения', 'is_correct': True,},
                    {'id': 2, 'value': 'Редакцию Инкотермс', 'is_correct': True},
                    {'id': 3, 'value': 'Дату прибытия груза'},
                    {'id': 4, 'value': 'Данные о всех транспортируемых грузах\nи сопроводительных документах',},
                ],
            },
            {
                'id': 4,
                'question': 'В каких документах прописываются условия поставки Инкотермс?',
                'options': [
                    {'id': 0, 'value': 'Контракт', 'is_correct': True},
                    {'id': 1, 'value': 'Инвойс', 'is_correct': True},
                    {'id': 2, 'value': 'Таможенная декларация', 'is_correct': True},
                    {'id': 3, 'value': 'Товарная накладная'},
                    {'id': 4, 'value': 'Транзитная декларация'},
                ],
            },
            {
                'id': 5,
                'question': 'Что такое базисные условия поставки Инкотермс?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Торговые термины, определяющие условия поставки товаров от продавца покупателю',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Условия обеспечение оптимизации использования транспортных ресурсов в системе ценообразования на товары и услуги',
                    },
                    {
                        'id': 2,
                        'value': 'Правила, определяющие перспективы развития грузообразующих отраслей с целью формирования сбалансированного товарообмена в стране',
                    },
                    {'id': 3, 'value': 'Условия выполнения договора поставки между грузовладельцем и перевозчиком',},
                ],
            },
        ],
        'second_block': [
            {
                'id': 6,
                'question': 'На какие 4 группы\nв зависимости от участия продавца и покупателя делятся базисы поставки?',
                'options': [
                    {'id': 0, 'value': 'E, F, C, D', 'is_correct': True},
                    {'id': 1, 'value': 'C, D, A, B'},
                    {'id': 2, 'value': 'Y, Z, W, X'},
                    {'id': 3, 'value': 'R, S, P, Q'},
                ],
            },
            {
                'id': 7,
                'question': 'В каких группах базисов поставки покупатель участвует в основной поставке?',
                'options': [
                    {'id': 0, 'value': 'E и F', 'is_correct': True},
                    {'id': 1, 'value': 'C и D'},
                    {'id': 2, 'value': 'E, F, C, D'},
                    {'id': 3, 'value': 'E, F, C'},
                ],
            },
            {
                'id': 8,
                'question': 'В каких группах базисов поставки покупатель не участвует в основной поставке?',
                'options': [
                    {'id': 0, 'value': 'С и D', 'is_correct': True},
                    {'id': 1, 'value': 'E и F'},
                    {'id': 2, 'value': 'E, F, C, D'},
                    {'id': 3, 'value': 'C, D, F'},
                ],
            },
            {
                'id': 9,
                'question': 'Выберите правильный вариант записи условия Инкотермс',
                'options': [
                    {'id': 0, 'value': 'FOB Shanghai Incoterms 2020', 'is_correct': True},
                    {'id': 1, 'value': 'FOB Incoterms 2020 Shanghai'},
                    {'id': 2, 'value': 'Shanghai FOB Incoterms 2020'},
                ],
            },
            {
                'id': 10,
                'question': 'В каком документе указываются условия перевозки, не входящие\nв Инкотермс?',
                'options': [
                    {'id': 0, 'value': 'Договор купли-продажи', 'is_correct': True},
                    {'id': 1, 'value': 'Товарная накладная'},
                    {'id': 2, 'value': 'Транзитная декларация'},
                ],
            },
        ],
        'third_block': [
            {
                'id': 11,
                'question': 'Для каких видов перевозок подходит базис поставки EXW?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Морские и речные перевозки'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.EXW,
            },
            {
                'id': 12,
                'question': 'Особенность базиса поставки EXW?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риски случайной порчи товара переходят\nот продавца к покупателю на складе продавца.\nВсе расходы тоже несет покупатель',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риск случайной гибели товара переходит\nот продавца к покупателю в момент погрузки товара на транспорт покупателя',
                    },
                    {
                        'id': 2,
                        'value': 'Риск случайной гибели товара переходит\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                    },
                ],
                'incoterm': Incoterm.EXW,
            },
            {
                'id': 13,
                'question': 'Какие обязанности ложатся на продавца\nпри EXW?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {
                        'id': 2,
                        'value': 'Предоставляет доступ к товару перевозчику, которого нанял покупатель',
                        'is_correct': True,
                    },
                    {'id': 3, 'value': 'Загружает товар на транспорт покупателя'},
                    {'id': 4, 'value': 'Оформляет таможенный экспорт'},
                ],
                'incoterm': Incoterm.EXW,
            },
            {
                'id': 14,
                'question': 'Какие обязанности ложатся на покупателя при EXW?',
                'options': [
                    {'id': 0, 'value': 'Грузит товар', 'is_correct': True},
                    {
                        'id': 1,
                        'value': 'Оформляет полную перевозку от завода поставщика до своего склада',
                        'is_correct': True,
                    },
                    {'id': 2, 'value': 'Оформляет таможенный экспорт', 'is_correct': True},
                    {'id': 3, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 4, 'value': 'Маркирует товар'},
                    {'id': 5, 'value': 'Упаковывает товар'},
                ],
                'incoterm': Incoterm.EXW,
            },
            {
                'id': 15,
                'question': 'Для каких видов перевозок подходит базис поставки FCA?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Морские и речные перевозки'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.FCA,
            },
            {
                'id': 16,
                'question': 'Особенность базиса поставки FCA?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риск случайной гибели товара переходит\nот продавца к покупателю в момент погрузки товара на транспорт покупателя',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риск случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара',
                    },
                    {
                        'id': 2,
                        'value': 'Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения',
                    },
                ],
                'incoterm': Incoterm.FCA,
            },
            {
                'id': 17,
                'question': 'Какие обязанности ложатся на продавца\nпри FCA?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Загружает товар на транспорт покупателя', 'is_correct': True},
                    {'id': 4, 'value': 'Оформляет таможенный импорт'},
                    {'id': 5, 'value': 'Выгружает товар из транспорта продавца'},
                ],
                'incoterm': Incoterm.FCA,
            },
            {
                'id': 18,
                'question': 'Какие обязанности ложатся на покупателя при FCA?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Организовывает основную перевозку: из места загрузки до своего склада',
                        'is_correct': True,
                    },
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление'},
                    {'id': 3, 'value': 'Загружает товар на транспорт покупателя'},
                    {'id': 4, 'value': 'Страхует товар в ходе всей основной перевозки'},
                ],
                'incoterm': Incoterm.FCA,
            },
            {
                'id': 19,
                'question': 'Для каких видов перевозок подходит базис поставки FAS?',
                'options': [
                    {'id': 0, 'value': 'Только морские и речные', 'is_correct': True},
                    {'id': 1, 'value': 'Любой вид перевозок'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.FAS,
            },
            {
                'id': 20,
                'question': 'Особенность базиса поставки FAS?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риск случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю после погрузки\nна судно, и покупатель несёт все расходы с этого момента',
                    },
                    {
                        'id': 2,
                        'value': 'Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения',
                    },
                ],
                'incoterm': Incoterm.FAS,
            },
            {
                'id': 21,
                'question': 'Какие обязанности ложатся на продавца\nпри FAS?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Доставляет товар в порт и выгружает рядом\nс бортом судна', 'is_correct': True},
                    {'id': 4, 'value': 'Оформляет таможенный импорт'},
                    {'id': 5, 'value': 'Загружает товар на судно покупателя'},
                ],
                'incoterm': Incoterm.FAS,
            },
            {
                'id': 22,
                'question': 'Какие обязанности ложатся на покупателя при FAS?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Заранее фрахтует место на судне и сообщает продавцу все данные — порт, судно перевозчика, время погрузки',
                        'is_correct': True,
                    },
                    {'id': 1, 'value': 'Грузит товар на судно', 'is_correct': True},
                    {'id': 2, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 3, 'value': 'Доставляет товар из порта до своего склада', 'is_correct': True},
                    {'id': 4, 'value': 'Осуществляет экспортное таможенное оформление'},
                    {'id': 5, 'value': 'Доставка груза от склада поставщика в порт'},
                ],
                'incoterm': Incoterm.FAS,
            },
            {
                'id': 23,
                'question': 'Для каких видов перевозок подходит базис поставки FOB?',
                'options': [
                    {'id': 0, 'value': 'Только морские и речные', 'is_correct': True},
                    {'id': 1, 'value': 'Любой вид перевозок'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.FOB,
            },
            {
                'id': 24,
                'question': 'Особенность базиса поставки FOB?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю после погрузки\nна судно, и покупатель несёт все расходы с этого момента',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                    },
                    {
                        'id': 2,
                        'value': 'Риски переходят после передачи продавцом товара перевозчику, а не в пункте назначения',
                    },
                ],
                'incoterm': Incoterm.FOB,
            },
            {
                'id': 25,
                'question': 'Какие обязанности ложатся на продавца\nпри FOB? ',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Доставляет товар в порт и загружает на судно', 'is_correct': True},
                    {'id': 4, 'value': 'Оформляет таможенный импорт'},
                    {'id': 5, 'value': 'Фрахтует место на судне'},
                ],
                'incoterm': Incoterm.FOB,
            },
            {
                'id': 26,
                'question': 'Какие обязанности ложатся на покупателя при FOB? ',
                'options': [
                    {
                        'id': 0,
                        'value': 'Заранее фрахтует место на судне и сообщает продавцу все данные — порт, судно перевозчика, время погрузки',
                        'is_correct': True,
                    },
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Доставляет товар из порта до своего склада', 'is_correct': True},
                    {'id': 3, 'value': 'Грузит товар на судно'},
                    {'id': 4, 'value': 'Осуществляет экспортное таможенное оформление'},
                ],
                'incoterm': Incoterm.FOB,
            },
            {
                'id': 27,
                'question': 'Для каких видов перевозок подходит базис поставки CFR?',
                'options': [
                    {'id': 0, 'value': 'Только морские и речные', 'is_correct': True},
                    {'id': 1, 'value': 'Любой вид перевозок'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.CFR,
            },
            {
                'id': 28,
                'question': 'Особенность базиса поставки CFR?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю после погрузки\nна судно. Расходы по доставке на покупателя не переходят с этого момента, доставку оплачивает поставщик',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                    },
                    {'id': 2, 'value': 'Риски переходят на складе продавца'},
                ],
                'incoterm': Incoterm.CFR,
            },
            {
                'id': 29,
                'question': 'Какие обязанности ложатся на продавца\nпри CFR?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Доставляет товар в порт и загружает на судно', 'is_correct': True},
                    {'id': 4, 'value': 'Фрахтует на судне и оплачивает транспортировку', 'is_correct': True},
                    {'id': 5, 'value': 'Выгружает товар с судна'},
                    {'id': 6, 'value': 'Оформляет таможенный импорт'},
                ],
                'incoterm': Incoterm.CFR,
            },
            {
                'id': 30,
                'question': 'Какие обязанности ложатся на покупателя при CFR?',
                'options': [
                    {'id': 0, 'value': 'Выгружает товар с судна', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Доставляет товар из порта до своего склада', 'is_correct': True},
                    {'id': 3, 'value': 'Грузит товар на судно'},
                    {'id': 4, 'value': 'Осуществляет экспортное таможенное оформление'},
                ],
                'incoterm': Incoterm.CFR,
            },
            {
                'id': 31,
                'question': 'Для каких видов перевозок подходит базис поставки CIF?',
                'options': [
                    {'id': 0, 'value': 'Только морские и речные', 'is_correct': True},
                    {'id': 1, 'value': 'Любой вид перевозок'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.CIF,
            },
            {
                'id': 32,
                'question': 'Особенность базиса поставки CIF?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риск переходит в момент размещения продавцом товара на судне',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                    },
                    {'id': 2, 'value': 'Риски переходят в пункте назначения'},
                ],
                'incoterm': Incoterm.CIF,
            },
            {
                'id': 33,
                'question': 'Какие обязанности ложатся на продавца\nпри CIF? ',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Доставляет товар в порт и загружает на судно', 'is_correct': True},
                    {'id': 4, 'value': 'Фрахтует на судне и оплачивает транспортировку', 'is_correct': True},
                    {'id': 5, 'value': 'Страхует груз от транспортных рисков покупателя', 'is_correct': True},
                    {'id': 6, 'value': 'Выгружает товар с судна'},
                    {'id': 7, 'value': 'Оформляет таможенный импорт'},
                ],
                'incoterm': Incoterm.CIF,
            },
            {
                'id': 34,
                'question': 'Какие обязанности ложатся на покупателя при CIF? ',
                'options': [
                    {'id': 0, 'value': 'Выгружает товар с судна', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Доставляет товар из порта до своего склада', 'is_correct': True},
                    {'id': 3, 'value': 'Грузит товар на судно'},
                    {'id': 4, 'value': 'Осуществляет экспортное таможенное оформление'},
                ],
                'incoterm': Incoterm.CIF,
            },
            {
                'id': 35,
                'question': 'Для каких видов перевозок подходит базис поставки CIP?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Только морские и речные'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.CIP,
            },
            {
                'id': 36,
                'question': 'Особенность базиса поставки CIP?',
                'options': [
                    {'id': 0, 'value': 'Риск переходит в момент размещения продавцом товара на судне'},
                    {
                        'id': 1,
                        'value': 'Риск переходит после передачи продавцом товара перевозчику, а не в пункте назначения. Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков.\nПри этом страхует груз от транспортных рисков покупателя',
                        'is_correct': True,
                    },
                    {'id': 2, 'value': 'Риски переходят в пункте назначения'},
                    {
                        'id': 3,
                        'value': 'Риски случайной гибели товара переходят\nот поставщика к покупателю в момент окончания разгрузки товара вдоль борта судна',
                    },
                ],
                'incoterm': Incoterm.CIP,
            },
            {
                'id': 37,
                'question': 'Какие обязанности ложатся на продавца\nпри CIP? ',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Загружает в транспорт, который сам нанял', 'is_correct': True},
                    {'id': 4, 'value': 'Доставляет товар в назначенное место', 'is_correct': True},
                    {'id': 5, 'value': 'Страхует груз в ходе всей основной перевозки', 'is_correct': True},
                    {'id': 6, 'value': 'Выгружает товар с судна'},
                    {'id': 7, 'value': 'Оформляет таможенный импорт'},
                ],
                'incoterm': Incoterm.CIP,
            },
            {
                'id': 38,
                'question': 'Какие обязанности ложатся на покупателя при CIP?',
                'options': [
                    {'id': 0, 'value': 'Выгружает товар с транспорта продавца', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Доставляет товар из пункта назначения до своего склада', 'is_correct': True},
                    {'id': 3, 'value': 'Грузит товар на судно'},
                    {'id': 4, 'value': 'Осуществляет экспортное таможенное оформление'},
                ],
                'incoterm': Incoterm.CIP,
            },
            {
                'id': 39,
                'question': 'Для каких видов перевозок подходит базис поставки CPT?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Только морские и речные'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.CPT,
            },
            {
                'id': 40,
                'question': 'Особенность базиса поставки CPT',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риски утраты и гибели товара переходят с продавца на покупателя в момент передачи товара первому перевозчику или предоставления товара',
                        'is_correct': True,
                    },
                    {'id': 1, 'value': 'Все риски и расходы несёт продавец'},
                    {
                        'id': 2,
                        'value': 'Риски случайной порчи товара переходят\nот продавца к покупателю на складе продавца',
                    },
                ],
                'incoterm': Incoterm.CPT,
            },
            {
                'id': 41,
                'question': 'Какие обязанности ложатся на продавца\nпри CPT? ',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Загружает на транспортное средство', 'is_correct': True},
                    {'id': 3, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 4, 'value': 'Осуществляет импортное таможенное оформление'},
                    {'id': 5, 'value': 'Выгружает товар в месте назначения'},
                    {'id': 6, 'value': 'Страхует груз от транспортных рисков', 'is_correct': True},
                ],
                'incoterm': Incoterm.CPT,
            },
            {
                'id': 42,
                'question': 'Какие обязанности ложатся на покупателя при CPT?',
                'options': [
                    {'id': 0, 'value': 'Загружает на транспортное средство '},
                    {'id': 1, 'value': 'Осуществляет экспортное таможенное оформление'},
                    {'id': 2, 'value': 'Осуществляет импортное таможенное оформление ', 'is_correct': True},
                    {'id': 3, 'value': 'Выгружает товар в месте назначения', 'is_correct': True},
                    {'id': 4, 'value': 'Страхует груз от транспортных рисков'},
                ],
                'incoterm': Incoterm.CPT,
            },
            {
                'id': 43,
                'question': 'Для каких видов перевозок подходит базис поставки DAP?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Только морские и речные'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.DAP,
            },
            {
                'id': 44,
                'question': 'Особенность базиса поставки DAP?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риск от продавца к покупателю переходит в пункте назначения',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной порчи товара переходят\nот продавца к покупателю на складе продавца',
                    },
                    {
                        'id': 2,
                        'value': 'Риск случайной гибели товара переходит\nот продавца к покупателю в момент погрузки товара на транспорт покупателя',
                    },
                ],
                'incoterm': Incoterm.DAP,
            },
            {
                'id': 45,
                'question': 'Какие обязанности ложатся на продавца\nпри DAP? ',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Загружает в транспорт, который сам нанял', 'is_correct': True},
                    {'id': 4, 'value': 'Доставляет товар в назначенное место', 'is_correct': True},
                    {'id': 5, 'value': 'Страхует груз от транспортных рисков покупателя'},
                    {'id': 6, 'value': 'Выгружает товар'},
                    {'id': 7, 'value': 'Оформляет таможенный импорт'},
                ],
                'incoterm': Incoterm.DAP,
            },
            {
                'id': 46,
                'question': 'Какие обязанности ложатся на покупателя при DAP? ',
                'options': [
                    {'id': 0, 'value': 'Выгружает товар из транспорта продавца', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 2, 'value': 'Оформляет таможенный экспорт'},
                    {'id': 3, 'value': 'Страхует груз'},
                ],
                'incoterm': Incoterm.DAP,
            },
            {
                'id': 47,
                'question': 'Для каких видов перевозок подходит базис поставки DPU?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Только морские и речные'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.DPU,
            },
            {
                'id': 48,
                'question': 'Особенность базиса поставки DPU?',
                'options': [
                    {
                        'id': 0,
                        'value': 'Риск порчи товара в ходе всей перевозки несёт продавец. Риск переходит в пункте назначения',
                        'is_correct': True,
                    },
                    {
                        'id': 1,
                        'value': 'Риски случайной порчи товара переходят\nот продавца к покупателю на складе продавца',
                    },
                    {
                        'id': 2,
                        'value': 'Риск случайной гибели товара переходит\nот продавца к покупателю в момент погрузки товара на транспорт покупателя',
                    },
                ],
                'incoterm': Incoterm.DPU,
            },
            {
                'id': 49,
                'question': 'Какие обязанности ложатся на продавца\nпри DPU?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Загружает в транспорт, который сам нанял', 'is_correct': True},
                    {'id': 4, 'value': 'Доставляет товар в назначенное место и выгружает его', 'is_correct': True},
                    {'id': 5, 'value': 'Страхует груз от транспортных рисков покупателя'},
                    {'id': 6, 'value': 'Оформляет таможенный импорт'},
                ],
                'incoterm': Incoterm.DPU,
            },
            {
                'id': 50,
                'question': 'Какие обязанности ложатся на покупателя при DPU?',
                'options': [
                    {'id': 0, 'value': 'Оформляет таможенный импорт', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный экспорт'},
                    {'id': 2, 'value': 'Страхует груз'},
                    {'id': 3, 'value': 'Загружает груз на транспорт'},
                ],
                'incoterm': Incoterm.DPU,
            },
            {
                'id': 51,
                'question': 'Для каких видов перевозок подходит базис поставки DDP?',
                'options': [
                    {'id': 0, 'value': 'Любой вид перевозок', 'is_correct': True},
                    {'id': 1, 'value': 'Только морские и речные'},
                    {'id': 2, 'value': 'Автомобильные перевозки'},
                    {'id': 3, 'value': 'Авиационные перевозки'},
                ],
                'incoterm': Incoterm.DDP,
            },
            {
                'id': 52,
                'question': 'Особенность базиса поставки DDP?',
                'options': [
                    {'id': 0, 'value': 'Все риски и расходы несёт продавец', 'is_correct': True},
                    {
                        'id': 1,
                        'value': 'Риски случайной порчи товара переходят\nот продавца к покупателю на складе продавца',
                    },
                    {
                        'id': 2,
                        'value': 'Риск случайной гибели товара переходит\nот продавца к покупателю в момент погрузки товара на транспорт покупателя',
                    },
                ],
                'incoterm': Incoterm.DDP,
            },
            {
                'id': 53,
                'question': 'Какие обязанности ложатся на продавца\nпри DDP?',
                'options': [
                    {'id': 0, 'value': 'Упаковывает товар', 'is_correct': True},
                    {'id': 1, 'value': 'Маркирует', 'is_correct': True},
                    {'id': 2, 'value': 'Осуществляет экспортное таможенное оформление', 'is_correct': True},
                    {'id': 3, 'value': 'Осуществляет импортное таможенное оформление', 'is_correct': True},
                    {'id': 4, 'value': 'Загружает в транспорт, который сам нанял', 'is_correct': True},
                    {'id': 5, 'value': 'Выгружает товар из транспорта продавца'},
                    {'id': 6, 'value': 'Страхует груз от транспортных рисков покупателя'},
                ],
                'incoterm': Incoterm.DDP,
            },
            {
                'id': 54,
                'question': 'Какие обязанности ложатся на покупателя при DDP? ',
                'options': [
                    {'id': 0, 'value': 'Выгружает товар из транспорта продавца', 'is_correct': True},
                    {'id': 1, 'value': 'Оформляет таможенный импорт'},
                    {'id': 2, 'value': 'Оформляет таможенный экспорт'},
                    {'id': 3, 'value': 'Страхует груз'},
                ],
                'incoterm': Incoterm.DDP,
            },
        ],
    },
    'control_test_questions': [
        {
            'id': 1,
            'question': 'InCoTerms (Инкотермс)',
            'options': [
                {'id': 0, 'value': 'Международные торговые термины', 'is_correct': True},
                {'id': 1, 'value': 'Международные коммерческие правила'},
                {'id': 2, 'value': 'Международная торговая терминология'},
                {'id': 3, 'value': 'Международные коммерческие условия поставки'},
            ],
        },
        {
            'id': 2,
            'question': 'Инкотермс определяют',
            'options': [
                {
                    'id': 0,
                    'value': 'Обязанности продавца и покупателя, риск перехода ответственности, ответственность сторон за расходы',
                    'is_correct': True,
                },
                {'id': 1, 'value': 'Обязанности продавца, покупателя, перевозчика'},
                {'id': 2, 'value': 'Обязанности продавца и покупателя, риск перехода ответственности'},
                {'id': 3, 'value': 'Обязанности продавца и покупателя, какая из сторон отвечает за расходы'},
            ],
        },
        {
            'id': 3,
            'question': 'Базисные условия поставки Инкотермс',
            'options': [
                {
                    'id': 0,
                    'value': 'Определяют обязанности покупателя и продавца\nпо доставке товара ',
                    'is_correct': True,
                },
                {
                    'id': 1,
                    'value': 'Устанавливают момент перехода риска повреждения товара или случайной утери',
                    'is_correct': True,
                },
                {
                    'id': 2,
                    'value': 'Описывают обязанности, риски, расходы продавцов\nи покупателей ',
                    'is_correct': True,
                },
                {'id': 3, 'value': 'Формируются на основе практики международной торговли', 'is_correct': True},
                {
                    'id': 4,
                    'value': 'Переиздаются и совершенствуются в зависимости\nот текущей ситуации',
                    'is_correct': True,
                },
            ],
        },
        {
            'id': 4,
            'question': 'Является ли Инкотермс\nс правовой точки зрения обязательным документом?',
            'options': [{'id': 0, 'value': 'Не является', 'is_correct': True}, {'id': 1, 'value': 'Является'}],
        },
        {
            'id': 5,
            'question': 'Что включает в себя Инкотермс 2020?',
            'options': [
                {'id': 0, 'value': '4 группы – 11 терминов ', 'is_correct': True},
                {'id': 1, 'value': '4 группы – 12 терминов'},
                {'id': 2, 'value': '4 группы – 10 терминов'},
                {'id': 3, 'value': '3 группы – 11 терминов'},
            ],
        },
        {
            'id': 6,
            'question': 'Как обозначается условие поставки «Свободно\nс завода»?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FCA'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 7,
            'question': 'Как обозначается условие поставки «Франко перевозчик»?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 8,
            'question': 'Как обозначается условие поставки «Свободно\nна борту»?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FCA'},
                {'id': 3, 'value': 'FAS'},
            ],
        },
        {
            'id': 9,
            'question': 'Как обозначается условие поставки «Свободно\nвдоль борта судна»?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FCA'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 10,
            'question': 'Как обозначается условие поставки «Стоимость\nи фрахт»?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 11,
            'question': 'Как обозначается условие поставки «Перевозка\nи страхование оплачены до…»?',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CPT'},
                {'id': 2, 'value': 'CIF'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 12,
            'question': 'Как обозначается условие поставки «Перевозка оплачена до…»?',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CIP'},
                {'id': 2, 'value': 'CIF'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 13,
            'question': 'Как обозначается условие поставки «Стоимость, страхование и фрахт»?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CIP'},
                {'id': 2, 'value': 'CPT'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 14,
            'question': 'Как обозначается условие поставки «Поставка\nс уплатой пошлины»?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DPU'},
            ],
        },
        {
            'id': 15,
            'question': 'Как обозначается условие поставки «Поставка\nв пункте назначения»?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DDP'},
                {'id': 3, 'value': 'DPU'},
            ],
        },
        {
            'id': 16,
            'question': 'Как обозначается условие поставки «Поставка\nв место выгрузки»?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'CIF'},
                {'id': 2, 'value': 'DDP'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 17,
            'question': 'По какому условию Группа «E» Инкотермс обозначает максимальную ответственность продавца?',
            'options': [
                {'id': 0, 'value': 'Отгрузка', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Основная перевозка оплачена'},
                {'id': 3, 'value': 'Прибытие'},
            ],
        },
        {
            'id': 18,
            'question': 'Какое условие группа «F» Инкотермс возлагает\nна продавца?',
            'options': [
                {'id': 0, 'value': 'Основная перевозка не оплачена', 'is_correct': True},
                {'id': 1, 'value': 'Отгрузка'},
                {'id': 2, 'value': 'Основная перевозка оплачена'},
                {'id': 3, 'value': 'Прибытие'},
            ],
        },
        {
            'id': 19,
            'question': 'Какое условие группа «С» Инкотермс возлагает\nна продавца?',
            'options': [
                {'id': 0, 'value': 'Основная перевозка оплачена', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Отгрузка'},
                {'id': 3, 'value': 'Прибытие '},
            ],
        },
        {
            'id': 20,
            'question': 'По какому условию группа «D» Инкотермс обозначает максимальную ответственность продавца?',
            'options': [
                {'id': 0, 'value': 'Прибытие', 'is_correct': True},
                {'id': 1, 'value': 'Основная перевозка не оплачена'},
                {'id': 2, 'value': 'Отгрузка'},
                {'id': 3, 'value': 'Основная перевозка оплачена'},
            ],
        },
        {
            'id': 21,
            'question': 'Термины, применимые\nдля любого вида транспорта ',
            'options': [
                {'id': 0, 'value': 'EXW, FCA, CIP, CPT, DDP, DAP, DPU', 'is_correct': True},
                {'id': 1, 'value': 'EXW, FCA, FOB, CPT, DDP, DAP, DPU'},
                {'id': 2, 'value': 'FOB, FAS, CFR, CIF, DDP, DAP'},
                {'id': 3, 'value': 'EXW, FCA, FOB, CPT, DDP, DPU'},
            ],
        },
        {
            'id': 22,
            'question': 'Термины, применимые только для морского\nи внутреннего водного транспорта ',
            'options': [
                {'id': 0, 'value': 'FOB, FAS, CFR, CIF', 'is_correct': True},
                {'id': 1, 'value': 'EXW, FCA, CIP, CPT'},
                {'id': 2, 'value': 'EXW, FCA, FOB, CPT'},
                {'id': 3, 'value': 'EXW, FCA, FOB, CFR'},
            ],
        },
        {
            'id': 23,
            'question': 'Какие термины обязывают страховать?',
            'options': [
                {'id': 0, 'value': 'CIF, CIP', 'is_correct': True},
                {'id': 1, 'value': 'FCA, FOB '},
                {'id': 2, 'value': 'CIF, FCA '},
                {'id': 3, 'value': 'CIP, FOB '},
            ],
        },
        {
            'id': 24,
            'question': 'Какой термин накладывает минимальную ответственность\nна продавца?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 25,
            'question': 'Какой термин накладывает максимальную ответственность\nна продавца?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 26,
            'question': 'В каком условии поставки продавец обязан предоставить готовый\nк отгрузке товар?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 27,
            'question': 'В каком условии поставки покупатель обязан выполнить экспортное, импортное таможенное оформление и доставить товар?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 28,
            'question': 'В каком условии поставки риски переходят в момент передачи товара\nна складе продавца?',
            'options': [
                {'id': 0, 'value': 'EXW', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 29,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи отгрузить товар перевозчику, назначенному покупателем?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 30,
            'question': 'В каком условии поставки покупатель обязан доставить товар\nи выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 31,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику\nна складе продавца?',
            'options': [
                {'id': 0, 'value': 'FCA', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 32,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи разместить товар\nв порту отгрузки\nвдоль борта судна, указанного покупателем?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 33,
            'question': 'В каком условии поставки покупатель обязан погрузить товар на судно и доставить в порт разгрузки, а также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 34,
            'question': 'В каком условии поставки риски переходят в порту\nв момент размещения товара вдоль борта судна?',
            'options': [
                {'id': 0, 'value': 'FAS', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 35,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи разместить товар\nв порту отгрузки\nи погрузить на борт судна, указанного покупателем?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 36,
            'question': 'В каком условии поставки покупатель обязан доставить товар в порт разгрузки, а также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'FOB', 'is_correct': True},
                {'id': 1, 'value': 'EXW'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 37,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, погрузить товар на борт судна и доставить в порт разгрузки?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 38,
            'question': 'В каком условии поставки покупатель обязан разгрузить и принять товар в порту разгрузки,\nа также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CFR', 'is_correct': True},
                {'id': 1, 'value': 'FOB'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 39,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, застраховать, погрузить товар на борт судна\nи доставить в порт разгрузки?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 40,
            'question': 'В каком условии поставки покупатель обязан разгрузить и принять товар в порту разгрузки,\nа также выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DAP'},
            ],
        },
        {
            'id': 41,
            'question': 'В каких условиях поставки риски переходят в порту отгрузки с момента полной погрузки на борт судна?',
            'options': [
                {'id': 0, 'value': 'FOB, CFR, CIF', 'is_correct': True},
                {'id': 1, 'value': 'CFR, CIF'},
                {'id': 2, 'value': 'FOB, CIF'},
                {'id': 3, 'value': 'FOB, CFR'},
            ],
        },
        {
            'id': 42,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, застраховать и доставить груз в согласованное место назначения?',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 43,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику\nна складе продавца? Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков. При этом страхует груз от транспортных рисков покупателя.',
            'options': [
                {'id': 0, 'value': 'CIP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 44,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи доставить груз\nв согласованное место назначения?',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 45,
            'question': 'В каком условии поставки риски переходят в момент передачи перевозчику\nна складе продавца? Продавец оплачивает транспортировку до места нахождения покупателя, но не несёт транспортных рисков.',
            'options': [
                {'id': 0, 'value': 'CPT', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'CIF'},
            ],
        },
        {
            'id': 46,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление\nи доставить груз\nдо согласованного пункта назначения?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 47,
            'question': 'В каком условии поставки риски переходят в пункте назначения?',
            'options': [
                {'id': 0, 'value': 'DAP', 'is_correct': True},
                {'id': 1, 'value': 'CFR'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 48,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, доставить товар до места назначения и выгрузить его?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 49,
            'question': 'В каких условиях поставки покупатель обязан принять товар и выполнить импортное таможенное оформление?',
            'options': [
                {'id': 0, 'value': 'CIP, CPT, DAP, DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP, DPU'},
                {'id': 2, 'value': 'CIP, CPT '},
                {'id': 3, 'value': 'DDP, DPU'},
            ],
        },
        {
            'id': 50,
            'question': 'В каком условии поставки риски переходят в месте назначения после полной выгрузки?',
            'options': [
                {'id': 0, 'value': 'DPU', 'is_correct': True},
                {'id': 1, 'value': 'DAP'},
                {'id': 2, 'value': 'FOB'},
                {'id': 3, 'value': 'DDP'},
            ],
        },
        {
            'id': 51,
            'question': 'В каком условии поставки продавец обязан выполнить экспортное таможенное оформление, доставить груз\nдо согласованного места назначения и выполнить импортное таможенное оформление с уплатой пошлин?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 52,
            'question': 'В каком условии поставки покупатель обязан принять товар?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
        {
            'id': 53,
            'question': 'В каком условии поставки риски переходят в месте назначения и все риски несет продавец?',
            'options': [
                {'id': 0, 'value': 'DDP', 'is_correct': True},
                {'id': 1, 'value': 'DPU'},
                {'id': 2, 'value': 'DAP'},
                {'id': 3, 'value': 'FOB'},
            ],
        },
    ],
    'logists': [
        {
            'letter': 'А',
            'types': ['TRAIN'],
            'texts': [
                """Компания А предоставляет услуги перевозки грузов железнодорожным транспортом «от двери 
до двери», проводит выходной контроль товара на заводе в Китае, терминальную обработку 
на станциях и т.д. 

Мы не перевозим опасные вещества, скоропортящиеся товары и драгоценные металлы, 
не экспортируем, не реэкспортируем и не осуществляем их транзит. Работаем в режиме «Импорт 40»:
Перевозим товары для внутреннего потребления.

Помогаем торговым, логистическим и производственным компаниям с оборотом от 100 млн. до 1 млрд. рублей. Мы работам только по типу FCL — Full container load (товар в контейнере принадлежит одному получателю).

Наш конёк — комплексная доставка грузов жд транспортом «дверь-дверь» за 28 дней включает в себя:

	• автоэкспедирование контейнера со склада поставщика на станцию в Китае;

	• терминальные расходы на станции в КНР;

	• доставка ускоренным поездом в Россию;

	• раскредитация на станции назначения и терминальная обработка поступившего туда контейнера;

	• таможенное оформление перевозимой продукции;

	• автоэкспедирование контейнера на склад клиента.

Дополнительные услуги:

	• терминальная и СВХ обработка продукции на станциях Москвы;

	• автовывоз контейнеров со станций;

	• страхование перевозки;

	• сертификация;

	• организация досмотров, если потребовал таможенный орган;

	• помощь в решении сложных вопросов при таможенном оформлении;

	• контроль lead time — планирование производства товаров на заводах в Китае.

Вы можете доверить компании ж/д доставку груза из Китая в Россию. Имеем успешный опыт сотрудничества с крупными поставщиками с 2017 года.  """
            ],
        },
        {
            'letter': 'Б',
            'types': ['TRAINS', 'CARS'],
            'texts': [
                """Компания Б — ведущий игрок на рынке мультимодальных контейнерных перевозок с приоритетом 
на железнодорожную логистику.Достигает лидерский позиций на рынке за счет внедрения современных технологий, а также за счет роста общего российского объема контейнерных перевозок.

Наша компания намерена и далее более активно развивать железнодорожные и автомобильные грузоперевозки. 

В состав совета директоров входят влиятельные эксперты с опытом работы в таких компаниях,
как ПАО «ТрансКонтейнер», ПАО «ЛУКОЙЛ», Brunswick Rail.

Наша компания предоставляет в аренду грузовые вагоны крупным корпоративным клиентам в России 
и за рубежом. Сегодня компания управляет солидным парком грузовых вагонов и контейнерным терминалом в Подмосковье, что позволяет нам и нашим клиентам получать дополнительные преимущества от участия в динамично растущих торговых операциях между Россией и соседними государствами.

Мы практикуем комплексный подход к организации перевозок, поэтому предоставляем клиентам весь спектр услуг, необходимых для всех возможных способов доставки по всей Евразии.

Среди них:

 - регулярные контейнерные железнодорожные грузоперевозки из Китая в Европу;

 - таможенная очистка;

 - складское хранение груза;

 - терминальная обработка;

 - лизинг подвижного состава;

 - расчёты с ОАО РЖД и его структурными подразделениями.

Мы обеспечиваем техническое и организационное сопровождение груза на всех этапах перевозки.

Как мы работаем:

 - работаем профессионально, оперативно и ответственно, поэтому нам доверяют не только частные, но и государственные заказчики, крупнейшие торговые и производственные компании.

 - гарантируем круглогодичный доступ к нашему парку вагонов – более 600 единиц;

 - оказываем консультационное сопровождение при выборе типа вагонов;

 - обеспечивает техническую исправность подвижного состава;

 - организуем перевозки в региональных и межконтинентальных направлениях;

 - сотрудничаем с крупнейшими автомобильными, морскими, воздушными перевозчиками;

 - сопровождаем доставку «от двери до двери»;

 - выполняем сопутствующие задачи (оформление сопроводительной документации, техническое обеспечение, взаимодействие с персоналом и ответственными работниками РЖД);

 - контролируем финансовые расчёты.

Будем рады предоставить Вам более детальную информацию с ценами по интересующим Вас маршрутам и скидку на первые заказы."""
            ],
        },
        {
            'letter': 'В',
            'types': ['TRAINS', 'SHIPS'],
            'texts': [
                """Компания В — это оптимальное сочетание мультимодального оператора контейнерных поездов 
и экспедиторской компании с 15-летним опытом и гибким подходом в работе с клиентами. Имеем многолетний опыт безупречной работы на рынке логистических услуг.

Ориентированы на долгосрочное взаимовыгодное сотрудничество с партнёрами и клиентами 
и предлагает весь комплекс Door-to-Door услуг логистического продукта высокого качества и уровня сервисного обслуживания от лица одной компании. 

Наша компания предоставляет клиенту полный набор логистических решений, как транспортные, терминально-складские, таможенно-брокерские и координационные. Предлагаемый сервис включает 
в себя услуги по организации морского фрахта, обработку в порту и отправку грузов ускоренными контейнерными поездами.

Являемся официальным партнёром Открытого акционерного общества «Российские железные дороги» и действительным членом Российской ассоциации экспедиторских и логистических компаний

Прямые договоры с морскими линейными операторами, собственные терминалы, фитинговые платформы, контейнеры

Конкурентные ставки на комплекс услуг по международным мультимодальным перевозкам из любой точки России

Координируем все этапы перевозки за счёт оперативного и качественного контроля всей транспортной цепочки

Организация терминальных услуг в Москве, Екатеринбурге, Новосибирске, Владивостоке, Новороссийске, Астрахани

Наши услуги:

 - Контейнерные перевозки

 - Импортные перевозки

 - Интермодальные сервисы

 - Контейнерные поезда из Прибалтики

 - Собственные контейнерные поезда с Дальнего Востока

 - Прямые контейнерные поезда из Китая

 - Экспортные перевозки

 - Сервисы через Южное направление

 - Прямые контейнерные поезда

 - Сервисы через Дальний Восток

 - Внутрироссийские перевозки

 - Морские перевозки"""
            ],
        },
        {
            'letter': 'Г',
            'types': ['TRAINS', 'SHIPS', 'CARS'],
            'texts': [
                """Компания Г уже более 10 лет занимается железнодорожными, мультимодальными, автомобильными 
и морскими перевозками.

Наша задача:

Обеспечение качественной логистикой клиентов «от двери до двери» с полным информационным 
и документальным сопровождением.

Услуги компании:

- Доставка из Китая

Обратившись в компанию, Вы получите до 3-х вариантов доставки груза. Специалисты 
при необходимости помогут Вам определить наиболее подходящий вариант исходя из Ваших пожеланий и критериев.

За все время нашей работы мы перевезли более 20 000 тонн различного вида груза: от морской рыбы до многотонных деталей портовых кранов.

- Железнодорожные перевозки

Доставляем груз в короткие сроки, работаем по системе доставки «от двери до двери». Стоимость перевозки грузов ЖД транспортом – самая оптимальная в сравнении с иными типами грузоперевозок.

В зависимости от характеристик перемещаемого груза, условий транспортировки, объемов ЖД перевозки грузов по России организовываются с привлечением крытых вагонов, вагонов для сыпучих материалов, цистерн, контейнеров, платформ, рефрижераторов.

- Склад

Выбирая в качестве партнера компанию, клиент полностью избавляется от необходимости организовывать собственную складскую инфраструктуру. Ведь данная деятельность сопровождается массой сложностей: наладить контроль над работой персонала, поиск высококлассного управленца, постоянный ремонт техники и предотвращение поломок, сложности при учете расходных материалов.

Компания имеет открытый и закрытый склад. Применяем в соответствии с характеристиками груза, сроками хранения и пожеланиями клиента.

- Мультимодальные перевозки

Организуем транспортировку грузов по мультимодальной системе перевозок, предполагающей задействование нескольких видов транспорта. Для оперативной доставки привлекаем железнодорожный, автомобильный, морской, авиационный транспорт.

Отличительная черта мультимодальных грузовых перевозок — перемещение грузов различным транспортом без переупаковывания.
Это идеальный вариант реализации системы транспортировки «от двери до двери», по которой работает компания 

- Сборные грузы

В компании вы можете выбрать тот вариант грузоперевозки, который будет отвечать вашим потребностям:

1) Если нужна срочная доставка сборных грузов и цена для вас неважна, то для этих целей подойдет авиаперевозка

2) Если хотите доставить товар быстро, но по доступной цене — перевозка сборных грузов автотранспортом

3) Если у вас в приоритете низкая стоимость — вам подойдут Ж/Д или морские перевозки

4) Вы также можете заказать контейнерную перевозку грузов — этот способ считается одним 
из наиболее безопасных: содержимое контейнеров надежно защищено от воздействия погодных условий, а универсальность тары позволяет легко и без повреждений перегружать товары с одного вида транспортного средства на другой

- Перевозка легковых автомобилей

Предлагаем перевезти Ваш автомобиль в режиме «одного окна»: Вашу перевозку полностью ведет один менеджер под ключ, который с Вами на связи 24/7.

В зависимости от маршрута и пожеланий клиента организуем перевозку легковых автомобилей ЖД-транспортом (контейнерами/вагонами/сетками) или АВТО-транспортом (автовозами и эвакуаторами, 
в т.ч. крытыми), а в исключительных случаях и АВИА-транспортом.

- Перевозка спецтехники до 300 тонн

- Перевозка опасных и температурных грузов

- Переезд роялей, пианино и фортепиано

- Переезд завода и фабрики

Преимущества и гарантии нашей компании:

- 3 варианта за 24 часа 

- Индивидуальный подход к каждому клиенту

- Склад на станции Кунцево 2 Московской железной дороги

- Оптимальные решения


"""
            ],
        },
        {
            'letter': 'Д',
            'types': ['TRAINS', 'SHIPS'],
            'texts': [
                """Компания Д - одна из крупнейших транспортно-логистических компаний в России с активами в сфере портового, железнодорожного и интегрированного логистического бизнеса. Диверсифицированный портфель активов позволяет осуществлять доставку грузов «от двери до двери» и контролировать все этапы интермодальной транспортной цепочки. 

Большая часть операций Группы сосредоточена на Дальнем Востоке России, что позволяет получать дополнительные преимущества от участия в динамично растущих объемах торговых операций между Россией и странами Азии.

Является лидером контейнерных перевозок через Дальний Восток РФ по внешнеторговым морским линиям в/из стран Азии, по каботажным морским линиям и по железной дороге, а также крупнейшим портовым контейнерным оператором Дальневосточного региона.

Компании принадлежит ПАО «Владивостокский морской торговый порт» ежегодной пропускной способностью 5 млн тонн генеральных грузов и нефтепродуктов, 82 тыс. единиц автомобилей 
и колесной техники и более 768 тыс. TEU контейнерных грузов. 

Также компания оперирует контейнерными терминальными комплексами в Новосибирске, Владивостоке, Хабаровске и Томске c общей пропускной способностью более 167 тыс. TEU в год. 

В управлении находится более 170 тыс. TEU, парк фитинговых платформ превышает 11 тыс. единиц. Автопарк составляет свыше 100 тягачей.

Флот включает 36 транспортных судов, которые преимущественно осуществляют перевозки 
на собственных морских линиях.

Компания предлагает широкий спектр логистических решений с использованием возможностей собственного и привлеченного морского, железнодорожного и автомобильного транспорта, стивидорного обслуживания на собственных терминалах в крупнейших портах России и СНГ 
и разветвленной сети представительств по всему миру.

Комплексные логистические услуги:

 - Рефрижераторные перевозки

 - Ответственное хранение

 - Перевозка спецтехники

 - Перевозка опасных грузов

 - Перевозка негабаритных грузов

 - Перевозка генеральных грузов

 - Авиаперевозки

 - Сборные грузы"""
            ],
        },
        {
            'letter': 'Е',
            'types': ['TRAINS'],
            'texts': [
                """Группа Компаний Е образована в 2004 году, является одним из крупнейших российских частных транспортных холдингов, который объединяет 31 компанию в разных регионах России и СНГ. 

Предоставляет клиентам полный комплекс транспортных услуг:

 - перевозки собственным подвижным составом

 - ремонт вагонов

 - логистические решения для предприятий

 - диспетчеризация

 - стивидорные услуги

Холдинг прочно закрепился в десятке лидеров операторского и вагоноремонтного бизнеса, а также входит в число лидеров рейтинга инвестиционной эффективности российских компаний.

Парк грузовых вагонов – более 25 тысяч единиц.

Собственное ремонтное производство объединяет 5 высокотехнологичных предприятий в Московской, Ленинградской, Иркутской, Кемеровской областях и в Алтайском крае.

В морском порту Усть-Луга (Ленинградская область) строит крупнейший в России многопрофильный терминал LUGAPORT грузооборотом 24,3 млн т в год.

Стивидорная компания является генеральным агентом ФГУП «Росморпорт» на паромном комплексе 
в порту Усть-Луга, где оказывает стивидорные и складские услуги.    

МИССИЯ ГРУППЫ КОМПАНИЙ
Развитие транспортной инфраструктуры России. Оптимизация расходов и времени клиентов на ремонт вагонов и транспортировку грузов с использованием собственных терминальных и складских мощностей, подвижного состава и вагоноремонтных предприятий."""
            ],
        },
        {
            'letter': 'И',
            'types': ['TRAINS'],
            'texts': [
                """Компания И – российская транспортно-логистическая компания, предоставляющая комплексные решения в организации мультимодальных и контейнерных перевозок, автомобильных, железнодорожных перевозок с привлечением собственного и арендованного подвижного состава, услуги терминально-складской и проектной логистики, управления цепями поставок с применением многооборотной тары.

Год основания — 2005. 

Компания работает с крупнейшими промышленными предприятиями, торговыми сетями России и СНГ, грузовладельцами из Китая, стран ЮВА, Балтии и Восточной Европы.Логистика — одно из приоритетных направлений бизнеса российской многопрофильной Группы компаний, основанной в 1992 году.

ПОЧЕМУ ВЫБИРАЮТ ДОСТАВКУ ИЗ КИТАЯ С НАШЕЙ КОМПАНИЕЙ:

 - Отлаженный сервис контейнерных поездов 

 - Широкий охват складской и терминальной сети

 - Собственный таможенный представитель

 - Актуальная информация о местонахождении и состоянии груза

 - Перевозки по всему миру по коносаменту FIATA

 - Многолетний опыт мультимодальных перевозок по всему миру


В управлении группы находится 14,5 тыс. вагонов, из которых 3,7 тыс. – фитинговые платформы 
для перевозки контейнеров, собственные терминалы в Новосибирске и Москве, широкая складская сеть по России. С 2018 года входит в тройку крупнейших российских операторов контейнерных перевозок.

Год за годом продолжает развивать собственные контейнерные сервисы, прежде всего наиболее востребованные грузоперевозки Китай - Москва.

В настоящее время мы предлагаем своим клиентам полный комплекс услуг по доставке грузов 
из Китая: транспортировка Short Sea до Владивостока или через сухие погран переходы от станций Эрлянь, Маньчжурия, Суйфэньхэ, Хоргос, Алашанькоу с доставкой грузов из Китая контейнерами 
по российским железным дорогам до Москвы, городов Сибири, а также сопроводительное таможенное оформление грузов из Китая."""
            ],
        },
        {
            'letter': 'К',
            'types': ['TRAINS'],
            'texts': [
                """Компания К – российская транспортная компания, основной род деятельности которой - организация перевозок грузов железнодорожным транспортом.

Свою миссию компания видит в максимальном упрощении для клиента процесса перемещения его груза из точки А в точку В, при этом в любой момент времени заказчик должен получить ответ на любой вопрос о перевозке, как осуществляющейся, так и потенциально для него возможной. Компания хочет 
в своем бизнесе быть, прежде всего, удобной и комфортной для партнеров, а также открытой
для нового сотрудничества.

Ценности компании – это, прежде всего, её клиенты, партнеры по бизнесу, а также персонал – три основополагающих «кита», на которых она строит свой успех. 

На сегодняшний день в эксплуатации находится более 4920 единиц вагонов, парк состоит преимущественно из хоппер-цементовозов, полувагонов, и универсальных платформ. Для обеспечения бесперебойного перевозочного процесса создана и успешно функционирует собственная диспетчерская служба, открыт Единый Лицевой Счет (ЕЛС) для расчетов по провозной плате с ОАО «РЖД», установлена система «ЭТРАН» для удаленного (дистанционного) оформления перевозочных документов, кроме того имеется возможность производить все виды ремонтов вагонам на всей сети железных дорог. Компания может в режиме реального времени информировать клиентов-грузовладельцев и контрагентов-собственников вагонов о местонахождении вагона с грузом, его порожнем рейсе или о производимых с вагонами ремонтных работах."""
            ],
        },
        {
            'letter': 'Л',
            'types': ['AIRPLANES', 'CARS',],
            'texts': [
                """Компания Л– мультисервисный оператор логистических услуг, эксперт в сфере комплексных решений 
и организации грузоперевозок на территории России и за рубежом.

Компания основана в 2001 году.

Филиальная сеть насчитывает свыше 300 отделений в России, Азербайджане, Армении, Беларуси, Казахстане, Узбекистане, Таджикистане, Киргизии, Турции и Китае.

Ежегодно услугами компании пользуются 4,5 млн клиентов.

Мы осуществляем доставку различных грузов массой до 20 тонн во многие города Российской Федерации, а также в Республику Казахстан.

Филиалы расположены в 128 городах. Ежегодно у нас заказывают транспортно-экспедиционные услуги свыше 1,5 млн. клиентов.

Виды перевозки:

 - Автоперевозка

Компания предоставляет транспортные услуги, которые включают в себя прием и оформление грузов 
в филиале компании, нанесение маркировки (уникального штрих-кода), перевозку грузов, оповещение клиента о прибытии грузов в пункт назначения (SMS, e-mail информирование) и выдачу груза получателю.

 - Авиаперевозка

В транспортно-экспедиторские услуги компании входит: прием грузов у отправителя, подбор наиболее подходящих рейсов, доставка грузов в аэропорт, оформление авианакладной, оплата терминальных сборов, перевозка грузов в филиал компании ПЭК в пункте назначения и их выдача получателю.

 - Перевозка сборного груза

Данный вид транспортных услуг – приоритетное направление работы. Транспортировка в составе сборных грузов дает возможность Компании сокращать расходы на перевозку, что создает выгодные условия и для клиентов.

 - Экспресс-Перевозка

Услуга «Экспресс-Перевозка» позволяет пользователям сохранить самый ценный и дорогой ресурс – время. По некоторым направлениям экономия составляет до 48 часов по сравнению с обычными сроками доставки.

 - Доставка в торговые сети

Услуга «Доставка в торговые сети» адресована поставщикам торговых сетей Тандер, Ашан, Лента, X5 Retail

 - Переезды по России

Для нас важен каждый клиент: и семья, решившая переехать в другой город, и огромная торговая сеть. Поэтому ежегодно нам доверяют миллионы заказчиков по всей России!

 - Full-Truck сервис

Заказ транспорта «под ключ» - индивидуальный подход для перевозок на разовой и регулярной основе. Любые объемы, любые направления, гибкие расценки.

Преимущества:

1)Компания располагает всем необходимым для организации доставки груза на участке первой 
и последней мили.

2)Практически в каждом филиале разработаны маршруты для консолидированных забора и доставки грузов из населенных пунктов, где нет филиалов, позволяющие сэкономить от 20 до 80% стоимости. География предоставления транспортных услуг льготной доставки превышает 500 маршрутов.

3)В перечень транспортно-экспедиционных услуг входит также выполнение погрузо-разгрузочных работ специалистами Компании, в том числе с привлечением для этих работ специальной техники.

4)Обработка груза на складе — обязательная услуга при областной перевозке

5)Комплексная услуга от компании по поиску, проверке, покупке и доставке товаров от поставщиков 
из Китая, Казахстана, Узбекистана и других стран.

6)Кроме услуги грузоперевозок, вы также можете заказать услугу страхования грузов, которые нужно доставить в города Российской Федерации (ставка 0,1% от стоимости груза) и в Республику Казахстан (ставка 0,3%).

7)Для обеспечения сохранности груза мы предлагаем более 10 видов дополнительной упаковки.

8)При заказе транспортно-экспедиторских услуг можно дополнительно воспользоваться услугой возврата документов с подписью и печатью получателя груза.

9)Компания предоставляет транспортные услуги более чем 50 федеральным торговым сетям.

10)По желанию клиента мы подготовим дубликат акта об оказанных услугах грузоперевозок, счет-фактуры или заверенную копию документа на выдачу груза.

11)Удобные транспортные услуги для интернет-магазинов и других компаний дистанционной торговли: прием оплаты от получателя в момент выдачи груза и оперативный перевод денежных средств продавцу.

12)«Доставка ко времени»: дополнительная услуга при доставке, которая подразумевает доставку
 в сокращенный временной интервал. Вместо 4 часов интервал сокращается до 30 минут.

13)Доставка документов курьером в Москве и Московской области."""
            ],
        },
        {
            'letter': 'М',
            'types': ['TRAINS'],
            'texts': [
                """Компания М - Логистическая экосистема для российской экономики и международных партнеров 
с применением инновационных транспортно-логистических решений с 2010 года.

Мультимодальный сервис

Организация доставки грузов в универсальных контейнерах железнодорожным транспортом 
и в мультимодальном сообщении. Мы осуществляем логистическое обслуживание международной торговли и производства на всем евразийском пространстве.

Перевозим для отраслей:

 - Розничная и оптовая торговля кроме температурных грузов

 - Производство товаров народного потребления

 - Автомобилестроение

 - Машиностроение

 - Электронная торговля

 - Лесная и деревообрабатывающая промышленность

 - Производство минеральных и химических удобрений

Преимущества работы с нами:

1)Страхование грузов

2)Прозрачность и надежность процесса доставки

3)Широкая филиальная и партнерская сеть в России и за рубежом

4) Возможность выбора сервисов как в прямом железнодорожном сообщении, 
так и в мультимодальном «железная дорога + море»

5)Возможность отправки по расписанию и высокая скорость доставки

6)Гарантия сохранности груза

7)Страхование ответственности экспедитора

8)Точно в срок

В рамках автомобилестроения организуем как доставку готовых автомобилей, так и логистическое обслуживание процесса производства – управление контейнерной доставкой широкой номенклатуры деталей для сборки по принципу «точно в срок» с учетом графика производства.

Для электронной торговли предлагаем сервис «сборных грузов»

Перевозки в сообщении с Китаем, странами АТР и Турцией

Мы организуем экспортно-импортные перевозки в сообщении с Китаем и странами АТР, в том числе Вьетнамом. В условиях изменения глобальных цепей поставок развиваем перевозки в сообщении 
с Турцией.

Наши услуги

 - Организация доставки «от двери до двери»

 - Таможенное оформление

 - Экспедирование всего пространства 1520/1435

 - Оперативное информирование о местонахождении груза

 - Документарное сопровождение и оплата провозных платежей

 - Страхование грузов"""
            ],
        },
        {
            'letter': 'Н',
            'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
            'texts': [
                """Компания Н - Международная команда экспертов в сфере управления цепями поставок с опытом решения задач любой сложности

 - Застрахованная профессиональная ответственность

 - Собственные склады

 - Таможенный перевозчик

 - Аттестованы на перевозку опасных грузов

 - Собственный автопарк

 - Таможенный представитель

 - Владелец таможенного склада

 - Соответствуем международным стандартам качества

Транспортные решения:

1)Авиаперевозки

2)Автомобильные перевозки

3)Автомобильные перевозки по РФ

4)Железнодорожные перевозки

5)Морские перевозки

6)Мультимодальные перевозки

7)Сборные грузы

8)Решения для цепей поставок

9)Интегрированные 4PL решения

10Маркировка товаров

11)Проектная логистика

12)Складская логистика

13)Таможенное оформление

14)Услуги таможенного склада

15)Специальные предложения

16)Доставка грузов из Китая в Россию

17)Доставка грузов из Турции в Россию

18)Экспресс авиадоставка из Китая

19)Доставка грузов из Индии в Россию

Наши ценности:

 - Доверие 

как в отношениях клиент-компания, так и внутри коллектива.

 - Новые идеи

Мы смотрим в будущее, создаём новые стандарты и развиваем технологии, позволяющие адаптироваться к новым вызовам времени.

 - Аутентичный опыт

Культивируем и гордимся существующим опытом наших экспертов и передаём структурированный опыт новым сотрудникам.

 - Человеческие отношения

Ценим живое общение, а не формальные протоколы, как при взаимодействии с клиентами,
так и внутри коллектива.

 - Профессиональная ответственность

Это профессиональный долг, который толкает выйти за рамки формальностей, когда это необходимо для дела. Как по отношению к клиенту, так и по отношению к коллегам. Наши сотрудники — это больше, чем функция. Это соратники и единомышленники.""",
            ],
        },
        {
            'letter': 'О',
            'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
            'texts': [
                """Компания О - ТРАНСПОРТНО-ЛОГИСТИЧЕСКАЯ КОМПАНИЯ 

Уже более 26 лет является надежным Партнером на рынке логистических и транспортных услуг. Предлагает комплексный сервис, включающий организацию международных перевозок различными видами транспорта, импортно-экспортное сопровождение, таможенные услуги, складские услуги, страхование грузов, проектную логистику, а также торговые услуги. 

Высококвалифицированные сотрудники компании находят оптимальные логистические решения исходя из индивидуальных потребностей каждого Клиента.

Корпоративные Клиенты получают гарантию качества услуг. Команда экспертов обслуживает Клиентов из каждой отрасли промышленности и предлагает решения, ориентируясь на потребности
и приоритеты. 

Для нас каждый Клиент - полноценный Партнер, с которым компания строит отношения на принципах доверия и взаимовыгодного сотрудничества. 


Услуги:

 - АВИА 

Скорость доставки и география полетов. Для оперативной и безопасной перевозки срочного груза 
в любую точку мира, заказывайте воздушную перевозку. 

 - АВТОМОБИЛЬНЫЕ 

Плановые и ежедневные доставки груза «от двери до двери» и слежение за местоположением 24 часа 7 дней в неделю доступны в автомобильном транспорте. 

 - МОРСКИЕ 

Выбирайте морские перевозки при грузоперевозках на дальние расстояния – экономичный, универсальный, надёжный вариант международного транспорта. 

 - ЖЕЛЕЗНОДОРОЖНЫЕ 

Для доставки товаров каждой категории и габаритов воспользуйтесь экологичным железнодорожным транспортом с четким планом отправлений и прибытий. 

1)Доставка через Достык Д

2)оставка через Забайкальск 

3)Доставка от двери до двери 

4)Обслуживание на жд терминалах

5)Ускоренные контейнерные поезда

 - МУЛЬТИМОДАЛЬНЫЕ

С учетом требований проекта комбинация нескольких видов транспорта для оптимизации сроков 
и затрат подбирается адресно в мультимодальных перевозках.

 - СБОРНЫЕ ГРУЗЫ 

Перевозки малогабаритных грузов возможны в составе сборной доставки 
и отдельным малогабаритным авто. Подбирайте вариант исходя из приоритетов. 

1)Кросс-доккинг 

2)Курьер на борту

3)Экспресс-доставка

 - ОТРАСЛЕВЫЕ РЕШЕНИЯ

 - СПЕЦИАЛЬНЫЕ ГРУЗЫ"""
            ],
        },
        {
            'letter': 'П',
            'types': ['CARS', 'TRAINS'],
            'texts': [
                """Компания П - Наша команда успешно осуществляет доставку грузов по всей территории России, СНГ 
и Европе, в том числе сложные маршруты в Воркуту, на о. Сахалин, на Курильские острова в Ирландию.

Мы находимся в Санкт-Петербурге на Северном таможенном посту. У нас есть склад и вся необходимая техника для перегрузки Ваших грузов. При необходимости производим таможенное оформление и сертификацию товаров.

Перевозим негабаритный груз. Перевозим грузы как таможенный перевозчик, осуществляем экспресс доставку в Европу (работаем со всей Европой). Работаем с карнетом АТА. Доставка грузов FTL и LTL. Перевозка грузов контейнером авто+ж/д+авто. Находим лучшее решение, исходя из поставленных задач клиента.

Услуги перевозки грузов по России, международная логистика, таможенное оформление, страхование, сертификация товаров.

В 90% случаев лучшие цены и сроки. Работаем с грузами от 100 кг.

Мы настроены на долгосрочные и успешные отношения с нашим клиентом."""
            ],
        },
        {
            'letter': 'Р',
            'types': ['TRAINS'],
            'texts': [
                """Компания Р – Лидер трансъевразийских железнодорожных контейнерных перевозок, предоставляющий комплексные услуги на перевозку грузов на самом протяженном участке Шелкового пути от границ 
с Китаем до границ с Европой, крупнейший оператор транзитных контейнерных перевозок в сообщении Китай-Европа-Китай по территории России, Казахстана и Беларуси.

Созданная в 2018 году выступает оператором транзитных контейнерных сервисов и транспортирует грузы в сообщении Китай–Европа–Китай в составе регулярных контейнерных поездов 
через территорию России, Казахстана и Беларуси.

 - НАША МИССИЯ

Развитие транзитного потенциала ЕАЭС через внедрение высокотехнологичных логистических сервисов, требующих скоординированной политики железных дорог и регуляторов на пространстве колеи 1520 мм

Компания предоставляет комплекс транспортно-логистических услуг по перевозке контейнеров отправителя (Shipper Owned Container — SOC) в составе регулярных контейнерных поездов по МТК «Восток-Запад».

 - ТРАНЗИТ

Маршруты Китай (Достык/Алтынколь) — Европа (Брест, Брузги, Свислочь, Калининград) 
по территориям Казахстана, России и Беларуси

 - ИМПОРТ

Перевозка грузов из КНР в Россию и Беларусь через погранпереходы Достык/Алтынколь

 - ЭКСПОРТ

Перевозка грузов из России и Беларуси в КНР до погранпереходов Достык/Алтынколь

КОМПЛЕКС ТРАНСПОРТНО-ЛОГИСТИЧЕСКИХ УСЛУГ ВКЛЮЧАЕТ:

1)Железнодорожный тариф по Казахстанской, Российским и Белорусской железным дорогам

2)Сборы за сменное сопровождение груза

3)Услуги по таможенному оформлению в соответствии с таможенным законодательством ЕАЭС

4)Сбор за таможенный осмотр перевозимых грузов

5)Предоставление фитинговой платформы

6)Погрузо-разгрузочные операции при смене колеи на территории ЕАЭС

Наши достижения:

- Стремительное развитие экспортно-импортных сервисов

- Кратный рост экспорта из Беларуси

- Первый контракт с оплатой в китайских юанях

- Пилотные отправки полносоставных рефрижераторных поездов
в сообщении Китай-Россия

- Экологические инициативы с нашим участием: Казахстан – проект
по восстановлению тугайного леса на территории «Иле-Балхаш»; Россия – проект по восстановлению численности зубров в Северной Осетии

- Выход в финал премии «Формула движения» в номинации «Лучшее решение в области грузовой логистики»

- Вошли в числе 400 крупнейших компаний России

- Генеральный директор— в списке 250 лучших топ-менеджеров России (по версии ИД «Коммерсант»)"""
            ],
        },
        {
            'letter': 'С',
            'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
            'texts': [
                """Компания С входит в состав инновационной транспортно-экспедиторской группы компаний, основанной в 1973 году в Германии, на предприятиях которой, на сегодняшний день, в мире работают более 600 высококвалифицированных, мультиязычных сотрудников.

Виды перевозок:

1) Автоперевозки

- генеральные, негабаритные, опасные, дорогостоящие и сборные грузы

2) Авиаперевозки

- мы являемся действующим членом WCA и IFLN и официальным агентом IATA

3) Морские перевозки

- наши агенты по всему миру согласуют забор груза с Вашим отправителем

4) Ж/Д перевозки

- доставим грузы из Китая, стран СНГ и ЕС в РФ и в обратном направлении

Наши услуги:

- Комплектные перевозки

- Сборные перевозки

- Экспресс перевозки

- Мультимодальные перевозки

- Негабаритные грузы

- Температурный режим

- Опасные грузы

- Проектная логистика

- Дистрибуционная логистика

- Логистика снабжения

- Аутсорсинг

- ВЭД

- Консолидация грузов

- Обработка грузов

- Складские услуги

- Таможенное оформление

- Страхование грузов                         	

Принципы и идеология нашей компании:

1) Полный пакет логистических услуг с широкой географией из одних рук

2) Профессиональность сотрудников BTG - наш основной капитал

3) Немецкие стандарты качества и надежность стабильной международной компании

4) Наша главная задача - служение интересам клиента

5) Наша цель - не только реализовать пожелания клиента, но и превзойти их

6) Современные IT технологии и возможности отслеживания груза

Наши основные направления:

- Из стран Европы в Россию и страны СНГ

- В страны Европы из России и стран СНГ

- По России, по Европе и странам СНГ

- Из Китая и стран ЮВА в Россию и страны СНГ

- Из России и стран СНГ в Китай и страны ЮВА

- По любым маршрутам внутри Европы

Почему выгодно с нами работать?

Благодаря широкой сети международных партнеров и филиалов группы компании по всему миру, наша компания осуществляет транспортно-экспедиторские услуги, включая внутренние и международные грузоперевозки железнодорожным, воздушным и морским транспортом, а также организует полное таможенное сопровождение, страхование и ответственное хранение грузов в собственных логистических комплексах.

Компания более четырех десятилетий осуществляет перевозки грузов
 по всему миру.

Персональный менеджер и гибкий подход для каждого клиента — это залог успеха нашего сотрудничества.

Мы предлагаем всестороннюю поддержку клиентам на всех этапах сотрудничества.

Обширная география присутствия компании позволяет вести переговоры на родном языке партнёра.
"""
            ],
        },
        {
            'letter': 'Т',
            'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
            'texts': [
                """Компания Т — предоставляет комплексные решения по перевозке
и таможенному оформлению любых видов грузов различными
видами транспорта в режимах импорта и экспорта.

Мы обеспечиваем: 

- Высококвалифицированных специалистов

- Персонального менеджера 24х7 Online

- «Белую» открытую бухгалтерию

- Финансовую гибкость: отсрочка, разные вылюты, резидент/нерезидент

- Оперативную юридическую поддержку

Вы получаете:

1) Прозрачную логистику

2) Оперативное решение приоритетных задач

3) Индивидуальный подход

4) Отсутствие рисков с Налоговыми Органами

5) Быстрота согласования договоров и разногласий

Наши услуги:

- Автоперевозки

- Ж/Д перевозки

- Морские перевозки

- Авиаперевозки

- Мульти модальные перевозки

- Сборные грузы

- Страхование

- Таможенное оформление

- Сертификация
"""
            ],
        },
        {
            'letter': 'Ф',
            'types': ['AIRPLANES', 'CARS', 'TRAINS', 'SHIPS'],
            'texts': [
                """Компания Ф с 1967 года доставляет товары в нужное время,в нужное место, с пользой для всех. Мы сотрудничаем с партнерамии клиентами в секторах потребительских товаров, розничной торговли, красоты и косметики, промышленного производстваи здравоохранения, чтобы действовать сообща, создавая модели ответственной цепочки поставок. Мы расширяем границы, чтобы к 2030 году стать лидером устойчивых омниканальных цепочек поставок.

Мы являемся «пионерами» в области пулинга транспортных средстви концепции под одной крышей one-roof. Мы продвигаем экологичные решения для копакинга и склады с нулевым выбросом углерода. Мы прилагаем все усилия, чтобы оптимизировать способы использования ресурсов, постоянно отслеживая и уменьшая углеродный след. Мы развиваем инновационную и устойчивую омниканальную дистрибуцию при помощи наших городских решений и предложения для готовой продукции в больших объемах. И мы не останавливаемся на достигнутом! Где бы мы ни находились, мы становимся надежным партнером для локальных компаний. Это было бы невозможно без нашей коллективной внутренней страсти и энергии, которую мы разделяем, создавая и реализовывая наши проекты. Вот почему мы ежедневно стараемся улучшать нашу рабочую среду и благополучие наших команд.

Мы оказываем полный спектр транспортно-логистических услуг и разрабатываем индивидуальные логистические решения для реализации ваших задач в сфере логистики. В рамках нашего комплекса логистических услуг мы предлагаем складские услуги и обработку товаров и грузов на складах, транспортные услуги, услуги таможенного оформления, IT-решения и комплексные решения 
для сегмента e-commerce.

Наша цель — помочь вам повысить эффективность бизнеса, снизить затраты и обеспечить надежность во всей цепи поставок.

Свяжитесь с нами, чтобы обсудить ваши потребности в логистических услугах. Мы готовы предложить вам оптимальные решения, адаптированные под требования вашего бизнеса.
"""
            ],
        },
        {
            'letter': 'Ц',
            'types': ['TRAINS'],
            'texts': [
                """Компания Ц — независимый оператор грузовых железнодорожных перевозок, лидирующий 
по количеству инновационного парка на сети РЖД.

Направления деятельности

- предоставление подвижного состава под перевозку различных номенклатур грузов 
как во внутрироссийском, так и в международном сообщении

- предоставление подвижного состава в арендное пользование

- транспортно-экспедиционное сопровождение груза по сети РЖД
 и иностранных государств

При выполнении логистических задач Общество ориентируется на поиск оптимальных решений. Четко отлаженный механизм взаимодействия со всеми участниками перевозочного процесса позволяет максимально эффективно задействовать ресурсы компании.

Миссия

Непрерывно развиваясь и двигаясь вперед, мы стремимся к достижению безупречного эффекта своей профессиональной деятельности. Предлагая один из самых молодых инновационных парков подвижного состава и внимательное обслуживание, мы предоставляем клиентам лучшие возможности для развития бизнеса. Мы не изобретаем колесо, мы его совершенствуем!

Стратегия
1) Быть лидером. Мы нацелены на укрепление лидирующих позицийна рынке грузовых железнодорожных перевозок

2) Быть устойчивым и универсальным. Мы дорожим долгосрочными партнерскими отношениями 
с крупными промышленными предприятиями и частными компаниями-грузоотправителями

3) Быть современным и гибким. Мы работаем над внедрением новых технологий и бизнес-процессов, повышающих уровень сервиса и организации перевозочного процесса

4) Повышать уровень знаний и компетенций. Мы совершенствуемся изнутри, постоянно развивая профессиональные компетенции нашей команды

Ценности и принципы

- Мобильность и лидерство. Мы стремимся быть лучшими и быстро реагировать на изменение рыночной ситуации, применяя индивидуальный подход к каждому клиенту

- Ответственность и профессионализм. Мы создаем благоприятную атмосферу для того, чтобы вклад каждого сотрудника положительно влиял на рост нашего бизнеса и бизнеса клиента, и стараемся выполнять свои обещания, оценивая результаты своей деятельности по самым строгим критериям

-Доверие и честность. Мы работаем в соответствии с высокими этическими стандартами, выступаем за прозрачность ведения бизнеса и доверяем своим сотрудникам, клиентам и партнерам

- Уважение к интересам клиента и его времени. Мы убеждены, что уважение стоит во главе партнерский взаимоотношений, поэтому погружаемся с головой в каждую стоящую перед нами задачу. Мы также ценим свое и чужое время, оно быстротечно и невосполнимо

- Команда является самым ценным ресурсом Общества. Мы дорожим каждым ее членом 
и поддерживаем стремления совершенствовать профессиональные навыки, инвестируя в человеческий капитал

Задачи

1) поддержание здоровой конкурентной среды

2) оказание положительного эффекта на развитие рынка железнодорожных перевозок России в целом

Преимущества

- один из крупнейших парков полувагонов. Компания занимает 3-е место по парку полувагонов на сети РЖД

- самый большой парк инновационных полувагонов. Компания занимает 1-е место по парку инновационных полувагонов на сети РЖД

- один из самых молодых парков на сети РЖД. Средний возраст парка компании составляет 5,9 лет при общесетевом — 10,5 лет. Компания занимает 2-е место по новизне парка среди других операторов на сети РЖД

- передовые информационные технологии, позволяющее наиболее эффективно организовать процесс перевозки груза. Предлагаем участникам рынка железнодорожных грузовых перевозок новейшие цифровые решения

- команда высококлассных специалистов. Мы привлекаем к работе квалифицированных менеджеров 
с опытом работы в транспортной отрасли и высокопрофессиональных специалистов из сфер IT, экономики и финансов. Кроме того, компания развивает профессиональные навыки своих сотрудников: среди сотрудников профильных подразделений проводится техническое обучение по устройству 
и обслуживанию инновационных полувагонов, деповскому ремонту, а также практика непосредственно на производственных площадках"""
            ],
        },
    ],
    'all_incoterms': ['EXW', 'FCA', 'FAS', 'FOB', 'CFR', 'CIF', 'CIP', 'CPT', 'DAP', 'DPU', 'DDP',],
    'hints': {
        'EXW': 'Покупатель может столкнуться с трудностями при выполнении экспортных формальностей',
        'FCA': 'Предусматривает два возможных места отгрузки: принадлежащее продавцу (склад) или указанное в договоре место (терминал) Следует точно определить пункт в месте доставки',
        'CPT': 'Следует максимально точно определить место поставки (переход рисков) и место назначения, до которого продавец оплачивает доставку',
        'CIP': 'Следует максимально точно определить место поставки (переход рисков) и место назначения, до которого продавец оплачивает доставку',
        'DAP': 'Следует максимально точно согласовать место назначения',
        'DPU': 'Следует максимально точно согласовать место назначения и возможность обеспечить выгрузку',
        'DDP': 'Следует согласовать возможность исполнения всех таможенных формальностей',
        'FAS': 'Следует максимально точно определить согласованное место загрузки в порту отправления ',
        'FOB': 'Нецелесообразно использовать, если товар передается перевозчику до того момента, как он попадет на борт судна',
        'CFR': 'Следует точно указать согласованное место в порту назначения ',
        'CIF': 'Продавец обязан предоставить страховой полис. Покупатель может потребовать более высокий уровень покрытия',
    },
}

practice_one_info = PR1ClassInfo(**raw_practice_one_info)

# if __name__ == '__main__':
#     print(practice_one_info.classic_test_questions.third_block[Incoterm.EXW][0])
